/// 列舉中國十二生肖：鼠、牛、虎、兔、龍、蛇、馬、羊、猴、雞、狗、豬。
pub(super) const THE_ZODIAC_SIGNS: [(&str, &str); 12] = [
    ("鼠", "鼠"),
    ("牛", "牛"),
    ("虎", "虎"),
    ("兔", "兔"),
    ("龍", "龙"),
    ("蛇", "蛇"),
    ("馬", "马"),
    ("羊", "羊"),
    ("猴", "猴"),
    ("雞", "鸡"),
    ("狗", "狗"),
    ("豬", "猪"),
];

/// 列舉中國十二生肖：鼠、牛、虎、兔、龍、蛇、馬、羊、猴、雞、狗、豬。
pub(super) const THE_ZODIAC_SIGNS_CHAR: [(char, char); 12] = [
    ('鼠', '鼠'),
    ('牛', '牛'),
    ('虎', '虎'),
    ('兔', '兔'),
    ('龍', '龙'),
    ('蛇', '蛇'),
    ('馬', '马'),
    ('羊', '羊'),
    ('猴', '猴'),
    ('雞', '鸡'),
    ('狗', '狗'),
    ('豬', '猪'),
];
