meili = ['姹', '娇', '娟', '丽', '翎', '美', '绮', '倩', '鸲', '妍', '玉', '雉']
piaoliang = ['艾', '靓', '帅']
meiyu = ['瑷', '璨', '瑾', '琳', '璐', '琦', '琪', '琼', '琬', '璇', '瑶', '瑛', '瑜']
gaoda = ['岸', '彪', '殿', '峻', '伉', '闶', '魁', '蓼', '岭', '巍', '嵬', '仡', '俣', '岳']
congming = ['慧', '神', '黠', '颖', '智']
nenggan = ['干', '行']
jiankang = ['好', '康', '养']
qinlao = ['劬']
yangguang = ['光', '晖', '晒', '旭']
zhongcheng = ['赤', '忠']
shanliang = ['良', '善', '淑', '驯']
jianqiang = ['刚', '劲', '强', '铁']
youmei = ['辞', '胜']
zhihui = ['哲', '智']
keai = ['娇', '可', '媚']
kuaile = ['忭', '欢', '恺', '乐', '陶', '喜', '怡', '娱', '豫']
fengfu = ['博', '丰', '富', '茂', '饶', '赡', '洋', '殷', '裕']
guang = [
    '白', '炳', '孛', '铂', '钚', '辰', '裎', '赤', '磋', '单', '挡',
    '荡', '灯', '碘', '电', '锇', '蒽', '铒', '菲', '感', '锆', '耿', '光', '硅', '鬼', '晷',
    '炅', '颢', '黑', '弘', '虹', '华', '滑', '焕', '晃', '晖', '辉', '火', '晶', '镜', '开',
    '朗', '铑', '镭', '锂', '笠', '亮', '溜', '麻', '猫', '镅', '镁', '锰', '蠓', '明', '磨',
    '氖', '霓', '硼', '篷', '钷', '镤', '槭', '漆', '荣', '铷', '润', '铯', '晒', '射', '晟',
    '鲥', '铊', '桃', '锑', '透', '炜', '硒', '熙', '熹', '洗', '霞', '氙', '跣', '星', '旭',
    '炫', '雪', '曛', '砑', '氩', '艳', '阳', '鳐', '曜', '耀', '晔', '烨', '熠', '阴', '荫',
    '铟', '瑛', '荧', '莹', '萤', '映', '瑜', '玉', '昱', '昀', '晕', '泽', '锃', '照', '锗',
    '铮', '支', '雉', '槠', '烛', '着'
]
guangming = ['炳', '耿', '炅', '焕', '明', '晟', '炜', '熙', '熹', '阴']

imageryDic = {}
