export const colorPalette = {
  /**
   * 赤
   */
  r1: "#C3272B",

  /**
   * 艶红
   */
  r2: "#C3272B",
  /**
   * 金
   */
  y1: "#EACD76",

  /**
   * 赤金
   */
  y2: "#F2BE45",

  /**
   * 青
   */
  c1: "#00E09E",
  /**
   * 毛绿色，柔和且清新，带有淡淡的绿色调。象征着自然与生机，毛绿常见于传统装饰与艺术作品中，传递出自然与生机的气息。
   */
  c2: "#66c18c",
  /**
   * 缥绿色
   */
  c3: "#7FECAD",
  /**
   * 青翠色
   */
  c4: "#00E079",
  /**
   * 宫殿绿 - 宫殿绿色，庄重沉稳，如古代宫廷围墙的青绿。此色象征威严与典雅，常用于宫廷纹样与古建筑彩饰中，透出端庄与肃穆的气氛。
   */
  c5: "#20894d",
  /**
   * 石青色
   */
  c6: "#7BCFA6",

  /**
   * 石绿色
   */
  c7: "#16A951",
  /**
   * 魏紫 - 出自古代宫廷华服之韵。此色象征尊贵与端庄，常在古典器物与宫廷绘饰中出现
   */
  p1: "#7e1671",

  /**
   * 木槿紫
   */
  p2: "#A381BA",

  /**
   * 槿紫
   */
  p3: "#806D9E",

  /**
   * 黑
   */
  b1: "#000000",

  /**
   * 油烟黑
   */
  b2: "#3F3F3C",

  /**
   * 墨黑
   */
  b3: "#50616D",

  /**
   * 玄色
   */
  b4: "#622A1D",

  /**
   * 白
   */
  w1: "#FFFFFF",
  /**
   * 乳白 - 乳白色，柔和如初乳，明亮而温婉。此色在中国传统中象征纯洁与温暖，常见于丝绸和瓷器，带来一种宁静而优雅的氛围。
   */
  w2: "#f9f4dc",
  /**
   * 缟白色
   */
  w3: "#F2ECDE",
  /**
   * 银白
   */
  w4: "#f1f0ed",

  /**
   * 铅白
   */
  w5: "#F0F0F4",

  /**
   * 米白
   */
  w6: "#f9e9cd",

  /**
   * 雪白
   */
  w7: "#F2FDFF",

  /**
   * 象牙白
   */
  w8: "#FFFBF0",

  /**
   * 大理石灰
   */
  g1: "#C4CBCF",

  /**
   * 雪灰
   */
  g2: "#CAD0D3",

  /**
   * 景泰蓝
   */
  l1: "#2775B6",

  /**
   * 飞燕草蓝 - 深沉且优雅，带有浓厚的蓝色调。象征着自由与智慧，飞燕草蓝常见于传统装饰与工艺品中，展现出自由与智慧的美感。
   */
  l2: "#0f59a4",

  /**
   * 鲜蓝
   */
  l3: "#004DB5",

  /**
   * 宝蓝
   */
  l4: "#4B5CC4",

  /**
   * 靛青
   */
  l5: "#1661AB",
};
