"use strict";

// Insert era name (年號) if appropriate
function eraName(year, region, li=null) {
    // set up an array of objects to store era name information
    let eras = [{y:1912, e:""}, {y:-99999, e:""}];
    let nian = "年";
    let zhou, lu, zhuanxu, chunqiu, shown;
    
    //Spring and Autumn period
    if (year >= -722 && year <=-480) {
        if (li===null) {
            shown = (document.getElementById("Spring").style.display == "block");
            zhou = document.getElementById('zhouSpring').classList.contains('active') && shown;
            chunqiu = document.getElementById('chunqiuSpring').classList.contains('active') && shown;
        } else {
            zhou = (li=='Zhou');
            chunqiu = (li=='Chunqiu');
        }
        
        // Zhou calendar
        if (zhou) {
            eras = [{y:1912, e:""}, 
                    {y:-518, e:"周敬王"}, {y:-543, e:"周景王"}, {y:-570, e:"周靈王"}, 
                    {y:-584, e:"周簡王"}, {y:-605, e:"周定王"}, {y:-611, e:"周匡王"}, 
                    {y:-617, e:"周頃王"}, {y:-650, e:"周襄王"}, {y:-675, e:"周惠王"}, 
                    {y:-680, e:"周僖王"}, {y:-695, e:"周莊王"}, {y:-718, e:"周桓王"}, 
                    {y:-771, e:"周平王"}, {y:-99999, e:""}];
        }
        
        // Chunqiu calendar
        if (chunqiu) {
            eras = [{y:1912, e:""}, 
                    {y:-493, e:"魯哀公"}, {y:-508, e:"魯定公"}, {y:-540, e:"魯昭公"}, 
                    {y:-571, e:"魯襄公"}, {y:-589, e:"魯成公"}, {y:-607, e:"魯宣公"}, 
                    {y:-625, e:"魯文公"}, {y:-658, e:"魯僖公"}, {y:-660, e:"魯閔公"}, 
                    {y:-692, e:"魯莊公"}, {y:-710, e:"魯桓公"}, {y:-721, e:"魯隱公"}, 
                    {y:-767, e:"魯惠公"}, {y:-99999, e:""}];
        }
    }
    
    //Warring States period
    if (year >= -479 && year <=-221) {
        if (li===null) {
            shown = (document.getElementById("Warring").style.display == "block");
            if (shown) {
                zhou = document.getElementById('zhouWarring').classList.contains('active');
                lu = document.getElementById('luWarring').classList.contains('active');
                zhuanxu = document.getElementById('zhuanxuWarring').classList.contains('active');
            } else {
                zhou = document.getElementById('zhouSpring').classList.contains('active');
                lu = document.getElementById('chunqiuSpring').classList.contains('active');
                zhuanxu = (document.getElementById("Spring").style.display=="none");
            }
        } else {
            zhou = (li=='Zhou');
            lu = (li=='Lu' || li=='Chunqiu');
            zhuanxu = (li=='Zhuanxu');
        }
        
        // Zhou calendar
        if (zhou) {
            eras = [{y:-254, e:""}, 
                    {y:-313, e:"周赧王"}, {y:-319, e:"周慎靚王"}, 
                    {y:-367, e:"周顯聖王"}, {y:-374, e:"周夷烈王"}, 
                    {y:-400, e:"周元安王"}, {y:-424, e:"周威烈王"}, 
                    {y:-439, e:"周考哲王"}, {y:-467, e:"周貞定王"}, 
                    {y:-475, e:"周元王"}, {y:-518, e:"周敬王"}, 
                    {y:-99999, e:""}];
        }
        
        // Lu calendar 
        if (lu) {
            eras = [{y:-247, e:""}, 
                    {y:-271, e:"魯頃公"}, {y:-294, e:"魯文公"}, {y:-313, e:"魯平公"}, 
                    {y:-342, e:"魯景公"}, {y:-351, e:"魯康公"}, {y:-375, e:"魯共公"}, 
                    {y:-406, e:"魯穆公"}, {y:-427, e:"魯元公"}, {y:-465, e:"魯悼公"}, 
                    {y:-493, e:"魯哀公"}, {y:-99999, e:""}];
        }
        
        // Zhuanxu calendar
        if (zhuanxu) {
            eras = [{y:1912, e:""}, 
                    {y:-245, e:"秦王政"}, {y:-248, e:"秦莊襄王"}, {y:-249, e:"秦孝文王"}, 
                    {y:-305, e:"秦昭襄王"}, {y:-306, e:""}];
        }
    }
    
    if (year==-220) {
        if (li===null) {
            shown = (document.getElementById("Warring").style.display == "block");
            zhuanxu = document.getElementById('zhuanxuWarring').classList.contains('active');
            if (!shown || (shown && zhuanxu)) {
                eras = [{y:-220, e:"秦始皇二十六年", offset:-1}];
            }
        } else  {
            if (li=='Zhuanxu') {
                eras = [{y:-220, e:"秦始皇二十六年", offset:-1}];
            }
        }
    }
    
    // Qin, Western Han and Xin dynasties
    if (year > -220 && year <=25) {
        eras = [{y:1912, e:""}, 
                    {y:25, e:"漢更始三年/光武帝建武元年", offset:-1},
                    {y:24, e:"漢更始二年", offset:-1},
                    {y:23, e:"新地皇四年/漢更始元年", offset:-1}, 
                    {y:20, e:"新地皇"}, {y:14, e:"新天鳳"}, 
                    {y:9, e:"新始建國"}, 
                    {y:8, e:"漢居攝三年/初始元年", offset:-1}, 
                    {y:6, e:"漢居攝"}, {y:1, e:"漢平帝元始"}, 
                    {y:-1, e:"漢哀帝元壽"}, {y:-5, e:"漢哀帝建平"}, 
                    {y:-7, e:"漢成帝綏和"}, {y:-11, e:"漢成帝元延"}, 
                    {y:-15, e:"漢成帝永始"}, {y:-19, e:"漢成帝鴻嘉"}, 
                    {y:-23, e:"漢成帝陽朔"}, 
                    {y:-26, e:"漢成帝河平", offset:1}, 
                    {y:-27, e:"漢成帝建始五年/河平元年", offset:-1}, 
                    {y:-31, e:"漢成帝建始"}, {y:-32, e:"漢元帝竟寧"}, 
                    {y:-37, e:"漢元帝建昭"}, {y:-42, e:"漢元帝永光"}, 
                    {y:-47, e:"漢元帝初元"}, {y:-48, e:"漢宣帝黃龍"}, 
                    {y:-52, e:"漢宣帝甘露"}, {y:-56, e:"漢宣帝五鳳"}, 
                    {y:-59, e:"漢宣帝神爵", offset:1}, 
                    {y:-60, e:"漢宣帝元康五年/神爵元年", offset:-1},
                    {y:-64, e:"漢宣帝元康"}, {y:-68, e:"漢宣帝地節"}, 
                    {y:-72, e:"漢宣帝本始"}, {y:-73, e:"漢昭帝元平"}, 
                    {y:-78, e:"漢昭帝元鳳", offset:1}, 
                    {y:-79, e:"漢昭帝始元七年/元鳳元年", offset:-1}, 
                    {y:-85, e:"漢昭帝始元"}, {y:-87, e:"漢武帝後元"}, 
                    {y:-91, e:"漢武帝征和"}, {y:-95, e:"漢武帝太始"}, 
                    {y:-99, e:"漢武帝天漢"}, {y:-103, e:"漢武帝太初"}, 
                    {y:-109, e:"漢武帝元封"}, {y:-115, e:"漢武帝元鼎"}, 
                    {y:-121, e:"漢武帝元狩"}, {y:-127, e:"漢武帝元朔"}, 
                    {y:-133, e:"漢武帝元光"}, {y:-139, e:"漢武帝建元"}, 
                    {y:-142, e:"漢景帝後元"}, {y:-148, e:"漢景帝中元"}, 
                    {y:-155, e:"漢景帝前元"}, {y:-162, e:"漢文帝後元"}, 
                    {y:-178, e:"漢文帝前元"}, {y:-186, e:"漢高后"}, 
                    {y:-193, e:"漢惠帝"}, {y:-205, e:"漢高祖"}, 
                    {y:-208, e:"秦二世"}, {y:-245, e:"秦始皇"}, 
                    {y:-99999, e:""}];
    }
 
    // Eastern Han dynasty
    if (year > 25 && year <= 220) {
        eras = [{y:1912, e:""}, 
                {y:220, e:"漢獻帝建安二十五年/延康元年/魏文帝黃初元年", offset:-1}, 
                {y:196, e:"漢獻帝建安"}, {y:194, e:"漢獻帝興平"}, 
                {y:190, e:"漢獻帝初平"}, {y:185, e:"漢靈帝中平", offset:1}, 
                {y:184, e:"漢靈帝光和七年/中平元年", offset:-1}, 
                {y:179, e:"漢靈帝光和", offset:1}, 
                {y:178, e:"漢靈帝熹平七年/光和元年", offset:-1}, 
                {y:173, e:"漢靈帝熹平", offset:1}, 
                {y:172, e:"漢靈帝建寧五年/熹平元年", offset:-1}, 
                {y:168, e:"漢靈帝建寧"}, 
                {y:167, e:"漢桓帝延熹十年/永康元年", offset:-1}, 
                {y:159, e:"漢桓帝延熹", offset:1}, 
                {y:158, e:"漢桓帝永壽四年/延熹元年", offset:-1}, 
                {y:155, e:"漢桓帝永壽"}, 
                {y:154, e:"漢桓帝永興二年", offset:-1}, 
                {y:153, e:"漢桓帝元嘉三年/永興元年", offset:-1}, 
                {y:151, e:"漢桓帝元嘉"}, {y:150, e:"漢桓帝和平"}, 
                {y:147, e:"漢桓帝建和"}, {y:146, e:"漢質帝本初"}, 
                {y:145, e:"漢沖帝永嘉"}, 
                {y:144, e:"漢順帝漢安三年/建康元年", offset:-1}, 
                {y:142, e:"漢順帝漢安"}, {y:136, e:"漢順帝永和"}, 
                {y:133, e:"漢順帝陽嘉", offset:1}, 
                {y:132, e:"漢順帝永建七年/陽嘉元年", offset:-1}, 
                {y:126, e:"漢順帝永建"}, {y:123, e:"漢安帝延光", offset:1}, 
                {y:122, e:"漢安帝建光二年/延光元年", offset:-1}, 
                {y:121, e:"漢安帝永寧二年/建光元年", offset:-1}, 
                {y:120, e:"漢安帝元初七年/永寧元年", offset:-1}, 
                {y:114, e:"漢安帝元初"}, {y:107, e:"漢安帝永初"}, 
                {y:106, e:"漢殤帝延平元年", offset:-1}, 
                {y:105, e:"漢和帝永元十七年/元興元年", offset:-1}, 
                {y:89, e:"漢和帝永元"}, 
                {y:88, e:"漢章帝章和二年", offset:-1}, 
                {y:87, e:"漢章帝元和四年/章和元年", offset:-1}, 
                {y:85, e:"漢章帝元和", offset:1}, 
                {y:84, e:"漢章帝建初九年/元和元年", offset:-1}, 
                {y:76, e:"漢章帝建初"}, {y:58, e:"漢明帝永平"}, 
                {y:57, e:"漢光武帝建武中元二年", offset:-1}, 
                {y:56, e:"漢光武帝建武三十二年/建武中元元年", offset:-1}, 
                {y:26, e:"漢光武帝建武", offset:1}, 
                {y:-99999, e:""}];
    }
    
    // Wei and Jin dynasties
    if (year > 220 && year <= 420 && region=='default') {
        eras = [{y:1912, e:""}, 
                {y:420, e:"晋恭帝元熙二年/[南北朝]宋武帝永初元年", offset:-1},
                {y:419, e:"晋恭帝元熙元年", offset:-1}, 
                {y:405, e:"晋安帝義熙"}, {y:403, e:"晋安帝元興", offset:1}, 
                {y:402, e:"晋安帝元興元年/大亨元年", offset:-1}, 
                {y:397, e:"晋安帝隆安"}, {y:376, e:"晋孝武帝太元"}, 
                {y:373, e:"晋孝武帝寧康"}, 
                {y:372, e:"晋簡文帝咸安二年", offset:-1},
                {y:371, e:"晋廢帝太和六年/簡文帝咸安元年", offset:-1}, 
                {y:366, e:"晋廢帝太和"}, {y:364, e:"晋哀帝興寧", offset:1}, 
                {y:363, e:"晋哀帝隆和二年/興寧元年", offset:-1}, 
                {y:362, e:"晋哀帝隆和元年", offset:-1}, 
                {y:357, e:"晋穆帝升平"}, {y:345, e:"晋穆帝永和"}, 
                {y:343, e:"晋康帝建元"}, {y:335, e:"晋成帝咸康"}, 
                {y:327, e:"晋成帝咸和", offset:1}, 
                {y:326, e:"晋明帝太寧四年/成帝咸和元年", offset:-1}, 
                {y:324, e:"晋明帝太寧", offset:1},
                {y:323, e:"晋明帝永昌二年/太寧元年", offset:-1},
                {y:322, e:"晋元帝永昌元年", offset:-1},
                {y:319, e:"晋元帝大興", offset:1},
                {y:318, e:"晋元帝建武二年/大興元年", offset:-1},
                {y:317, e:"晋愍帝建興五年/元帝建武元年", offset:-1},
                {y:314, e:"晋愍帝建興", offset:1}, 
                {y:313, e:"晋懷帝永嘉七年/愍帝建興元年", offset:-1}, 
                {y:307, e:"晋懷帝永嘉"}, 
                {y:306, e:"晋惠帝永興三年/光熙元年", offset:-1}, 
                {y:305, e:"晋惠帝永興二年", offset:-1}, 
                {y:304, e:"晋惠帝永安/建武/永興元年", offset:-1}, 
                {y:303, e:"晋惠帝太安二年", offset:-1}, 
                {y:302, e:"晋惠帝永寧二年/太安元年", offset:-1}, 
                {y:301, e:"晋惠帝永康二年/永寧元年", offset:-1}, 
                {y:300, e:"晋惠帝永康元年", offset:-1}, 
                {y:292, e:"晋惠帝元康", offset:1}, 
                {y:291, e:"晋惠帝永平元年/元康元年", offset:-1}, 
                {y:290, e:"晋武帝太熙元年/惠帝永熙元年", offset:-1}, 
                {y:281, e:"晋武帝太康", offset:1}, 
                {y:280, e:"晋武帝咸寧六年/太康元年", offset:-1}, 
                {y:275, e:"晋武帝咸寧"}, {y:266, e:"晋武帝泰始", offset:1}, 
                {y:265, e:"魏元帝咸熙二年/晋武帝泰始元年", offset:-1}, 
                {y:264, e:"魏元帝景元五年/咸熙元年", offset:-1}, 
                {y:261, e:"魏元帝景元", offset:1}, 
                {y:260, e:"魏甘露五年/元帝景元元年", offset:-1}, 
                {y:257, e:"魏甘露", offset:1}, 
                {y:256, e:"魏正元三年/甘露元年", offset:-1}, 
                {y:255, e:"魏正元二年", offset:-1}, 
                {y:254, e:"魏嘉平六年/正元元年", offset:-1}, 
                {y:250, e:"魏嘉平", offset:1}, 
                {y:249, e:"魏正始十年/嘉平元年", offset:-1}, 
                {y:240, e:"魏正始"}, {y:238, e:"魏明帝景初", offset:1}, 
                {y:237, e:"魏明帝青龍五年/景初元年", offset:-1}, 
                {y:234, e:"魏明帝青龍", offset:1}, 
                {y:233, e:"魏明帝太和七年/青龍元年", offset:-1}, 
                {y:227, e:"魏明帝太和"}, {y:221, e:"魏文帝黃初", offset:1}, 
                {y:-99999, e:""}];
    }
    
    // Shu dynasty
    if (region=='Shu' && year >= 221 && year <= 263) {
        eras = [{y:1912, e:""}, 
                {y:264, e:"魏元帝景元五年/咸熙元年", offset:-1},
                {y:263, e:"蜀後主景耀六年/炎興元年", offset:-1},
                {y:258, e:"蜀後主景耀"}, {y:238, e:"蜀後主延熙"},
                {y:224, e:"蜀後主建興", offset:1}, 
                {y:223, e:"蜀昭烈帝章武三年/後主建興元年", offset:-1},
                {y:221, e:"蜀昭烈帝章武"},
                {y:-99999, e:""}];
    }
    
    // Wu dynasty
    if (region=='Wu' && year >= 222 && year <= 280) {
        eras = [{y:1912, e:""}, 
                {y:281, e:"晋武帝太康", offset:1}, {y:277, e:"吳天紀"},
                {y:276, e:"吳天冊二年/天璽元年", offset:-1}, 
                {y:275, e:"吳天冊元年", offset:-1},
                {y:272, e:"吳鳳凰"}, {y:270, e:"吳建衡", offset:1}, 
                {y:269, e:"吳寶鼎四年/建衡元年", offset:-1},
                {y:267, e:"吳寶鼎", offset:1}, 
                {y:266, e:"吳甘露二年/寶鼎元年", offset:-1},
                {y:265, e:"吳元興二年/甘露元年", offset:-1}, 
                {y:264, e:"吳永安七年/元興元年", offset:-1},
                {y:259, e:"吳景帝永安", offset:1}, 
                {y:258, e:"吳太平三年/永安元年", offset:-1},
                {y:257, e:"吳太平二年", offset:-1}, 
                {y:256, e:"吳五鳳三年/太平元年", offset:-1},
                {y:254, e:"吳五鳳"}, {y:253, e:"吳建興二年", offset:-1},
                {y:252, e:"吳太元二年/神鳳元年/建興元年", offset:-1},
                {y:251, e:"吳大帝赤烏十四年/太元元年", offset:-1},
                {y:239, e:"吳大帝赤烏", offset:1}, 
                {y:238, e:"吳大帝嘉禾七年/赤烏元年", offset:-1},
                {y:232, e:"吳大帝嘉禾"}, {y:230, e:"吳大帝黃龍", offset:1},
                {y:229, e:"吳大帝黃武八年/黃龍元年", offset:-1},
                {y:222, e:"吳大帝黃武"},
                {y:-99999, e:""}];
    }
    
    // Later Qin
    if (year > 383.5 && year < 417.5 && region=='LaterQin') {
        eras = [{y:1912, e:""}, {y:417, e:"後秦永和二年", offset:-1},
                {y:416, e:"後秦弘始十八年/永和元年", offset:-1},
                {y:400, e:"後秦文桓帝弘始", offset:1}, 
                {y:399, e:"後秦文桓帝皇初六年/弘始元年", offset:-1},
                {y:395, e:"後秦文桓帝皇初", offset:1},
                {y:394, e:"後秦武昭帝建初九年/文桓帝皇初元年", offset:-1},
                {y:387, e:"後秦武昭帝建初", offset:1},
                {y:386, e:"後秦武昭帝白雀三年/建初元年", offset:-1}, 
                {y:384, e:"後秦武昭帝白雀"},
                {y:-99999, e:""}];
    }
    
    // Northern Liang
    if (year > 410.5 && year < 439.5 && region=='NorthernLiang') {
        eras = [{y:1912, e:""}, {y:434, e:"北涼承和", offset:1},
                {y:433, e:"北涼義和三年/承和元年", offset:-1},
                {y:432, e:"北涼義和二年", offset:-1}, 
                {y:431, e:"北涼承玄四年/義和元年", offset:-1},
                {y:429, e:"北涼承玄", offset:1}, 
                {y:428, e:"北涼玄始十七年/承玄元年", offset:-1},
                {y:413, e:"北涼玄始", offset:1}, 
                {y:412, e:"北涼永安十二年/玄始元年", offset:-1},
                {y:402, e:"北涼永安", offset:1}, 
                {y:401, e:"北涼天璽三年/永安元年", offset:-1},
                {y:400, e:"北涼天璽二年", offset:-1}, 
                {y:399, e:"北涼神璽三年/天璽元年", offset:-1},
                {y:397, e:"北涼神璽"}, {y:-99999, e:""}];
    }
    
    // Northern Wei, Western Wei, Northern Zhou and Sui
    if (year > 385.5 && year < 590.5 && region=='WeiZhouSui') {
        eras = [{y:1912, e:""}, {y:581, e:"隋文帝開皇"},
                {y:579, e:"北周靜帝大象"},
                {y:578, e:"北周武帝建德七年/宣政元年", offset:-1},
                {y:573, e:"北周武帝建德", offset:1}, 
                {y:572, e:"北周武帝天和七年/建德元年", offset:-1},
                {y:566, e:"北周武帝天和"}, {y:561, e:"北周武帝保定"},
                {y:559, e:"北周明帝武成"}, {y:557, e:"北周明帝"},
                {y:554, e:"西魏恭帝"}, {y:552, e:"西魏元欽"},
                {y:535, e:"西魏文帝大統"},  {y:532, e:"北魏孝武帝永熙"},
                {y:531, e:"北魏普泰/中興元年", offset:-1}, 
                {y:530, e:"北魏永安三年/建明元年", offset:-1},
                {y:529, e:"北魏孝莊帝永安二年", offset:-1}, 
                {y:528, e:"北魏武泰/建義/永安元年", offset:-1},
                {y:526, e:"北魏孝明帝孝昌", offset:1}, 
                {y:525, e:"北魏孝明帝正光六年/孝昌元年", offset:-1},
                {y:521, e:"北魏孝明帝正光", offset:1}, 
                {y:520, e:"北魏孝明帝神龜三年/正光元年", offset:-1},
                {y:519, e:"北魏孝明帝神龜二年", offset:-1}, 
                {y:518, e:"北魏孝明帝熙平三年/神龜元年", offset:-1},
                {y:516, e:"北魏孝明帝熙平"}, {y:513, e:"北魏宣武帝延昌", offset:1},
                {y:512, e:"北魏宣武帝永平五年/延昌元年", offset:-1},
                {y:509, e:"北魏宣武帝永平", offset:1}, 
                {y:508, e:"北魏宣武帝正始五年/永平元年", offset:-1},
                {y:504, e:"北魏宣武帝正始"}, {y:500, e:"北魏宣武帝景明"},
                {y:477, e:"北魏孝文帝太和"},
                {y:476, e:"北魏孝文帝延興六年/承明元年", offset:-1},
                {y:472, e:"北魏孝文帝延興", offset:1},
                {y:471, e:"北魏獻文帝皇興五年/孝文帝延興元年", offset:-1},
                {y:468, e:"北魏獻文帝皇興", offset:1}, 
                {y:467, e:"北魏獻文帝天安二年/皇興元年", offset:-1},
                {y:466, e:"北魏獻文帝天安元年", offset:-1}, 
                {y:460, e:"北魏文成帝和平"},
                {y:456, e:"北魏文成帝太安", offset:1}, 
                {y:455, e:"北魏文成帝興光二年/太安元年", offset:-1},
                {y:454, e:"北魏文成帝興安三年/興光元年", offset:-1},
                {y:453, e:"北魏文成帝興安二年", offset:-1},
                {y:452, e:"北魏正平二年/承平/興安元年", offset:-1},
                {y:451, e:"北魏太武帝太平真君十二年/正平元年", offset:-1},
                {y:441, e:"北魏太武帝太平真君", offset:1},
                {y:440, e:"北魏太武帝太延六年/太平真君元年", offset:-1},
                {y:435, e:"北魏太武帝太延"}, {y:432, e:"北魏太武帝延和"},
                {y:429, e:"北魏太武帝神䴥", offset:1},
                {y:428, e:"北魏太武帝始光五年/神䴥元年", offset:-1},
                {y:424, e:"北魏太武帝始光"}, {y:417, e:"北魏明元帝泰常", offset:1},
                {y:416, e:"北魏明元帝神瑞三年/泰常元年", offset:-1},
                {y:414, e:"北魏明元帝神瑞"}, {y:410, e:"北魏明元帝永興", offset:1},
                {y:409, e:"北魏道武帝天賜六年/明元帝永興元年", offset:-1},
                {y:405, e:"北魏道武帝天賜", offset:1}, 
                {y:404, e:"北魏道武帝天興七年/天賜元年", offset:-1},
                {y:398, e:"北魏道武帝天興"}, 
                {y:397, e:"北魏道武帝皇始二年", offset:-1},
                {y:396, e:"北魏道武帝登國十一年/皇始元年", offset:-1},
                {y:386, e:"北魏道武帝登國"}, {y:-99999, e:""}];
    }
    
    // Eastern Wei and Northern Qi
    if (year > 533.5 && year < 577.5 && region=='WeiQi') {
        eras = [{y:1912, e:""}, {y:577, e:"北齊承光"},
                {y:570, e:"北齊武平"}, {y:566, e:"北齊天統", offset:1},
                {y:565, e:"北齊河清四年/天統元年", offset:-1},
                {y:563, e:"北齊武成帝河清", offset:1},
                {y:562, e:"北齊武成帝太寧二年/河清元年", offset:-1},
                {y:561, e:"北齊孝昭帝皇建二年/武成帝太寧元年", offset:-1},
                {y:560, e:"北齊乾明元年/孝昭帝皇建元年", offset:-1},
                {y:550, e:"北齊文宣帝天保"}, {y:543, e:"東魏武定"},
                {y:540, e:"東魏興和", offset:1}, 
                {y:539, e:"東魏元象二年/興和元年", offset:-1},
                {y:538, e:"東魏元象元年", offset:-1}, 
                {y:534, e:"東魏天平"}, {y:532, e:"北魏孝武帝永熙"},
                {y:-99999, e:""}];
    }
    
    // Southern dynasties, Sui dynasty
    if (year > 420 && year < 618 && region=='default') {
        eras = [{y:1912, e:""}, 
                {y:617, e:"隋煬帝大業十三年/恭帝義寧元年", offset:-1},
                {y:605, e:"隋煬帝大業"}, {y:601, e:"隋文帝仁壽"}, 
                {y:590, e:"隋文帝開皇", offset:9}, 
                {y:587, e:"[南北朝]陳後主禎明"}, 
                {y:583, e:"[南北朝]陳後主至德"}, 
                {y:569, e:"[南北朝]陳宣帝太建"}, {y:567, e:"[南北朝]陳伯宗光大"}, 
                {y:566, e:"[南北朝]陳文帝天嘉七年/天康元年", offset:-1}, 
                {y:560, e:"[南北朝]陳文帝天嘉"}, {y:558, e:"[南北朝]陳武帝永定", offset:1}, 
                {y:557, e:"[南北朝]梁敬帝太平二年/陳武帝永定元年", offset:-1}, 
                {y:556, e:"[南北朝]梁敬帝紹泰二年/太平元年", offset:-1}, 
                {y:555, e:"[南北朝]梁元帝承聖四年/閔帝天成元年/敬帝紹泰元年", offset:-1}, 
                {y:552, e:"[南北朝]梁元帝承聖"}, {y:550, e:"[南北朝]梁簡文帝大寶"}, 
                {y:548, e:"[南北朝]梁武帝太清", offset:1},
                {y:547, e:"[南北朝]梁武帝中大同二年/太清元年", offset:-1},
                {y:546, e:"[南北朝]梁武帝大同十二年/中大同元年", offset:-1},
                {y:535, e:"[南北朝]梁武帝大同"},
                {y:530, e:"[南北朝]梁武帝中大通", offset:1},
                {y:529, e:"[南北朝]梁武帝大通三年/中大通元年", offset:-1},
                {y:528, e:"[南北朝]梁武帝大通二年", offset:-1}, 
                {y:527, e:"[南北朝]梁武帝普通八年/大通元年", offset:-1}, 
                {y:520, e:"[南北朝]梁武帝普通"}, 
                {y:503, e:"[南北朝]梁武帝天監", offset:1}, 
                {y:502, e:"[南北朝]齊中興二年/梁武帝天監元年", offset:-1}, 
                {y:501, e:"[南北朝]齊永元三年/中興元年", offset:-1}, 
                {y:499, e:"[南北朝]齊永元"}, 
                {y:498, e:"[南北朝]齊明帝建武五年/永泰元年", offset:-1}, 
                {y:495, e:"[南北朝]齊明帝建武", offset:1},
                {y:494, e:"[南北朝]齊隆昌元年/延興元年/明帝建武元年", offset:-1},
                {y:483, e:"[南北朝]齊武帝永明"}, 
                {y:480, e:"[南北朝]齊高帝建元", offset:1}, 
                {y:479, e:"[南北朝]宋順帝昇明三年/齊高帝建元元年", offset:-1}, 
                {y:478, e:"[南北朝]宋順帝昇明二年", offset:-1}, 
                {y:477, e:"[南北朝]宋元徽五年/順帝昇明元年", offset:-1}, 
                {y:473, e:"[南北朝]宋元徽"}, 
                {y:472, e:"[南北朝]宋明帝泰豫元年", offset:-1}, 
                {y:466, e:"[南北朝]宋明帝泰始", offset:1}, 
                {y:465, e:"[南北朝]宋廢帝永光元年/景和元年/明帝泰始元年", offset:-1}, 
                {y:457, e:"[南北朝]宋孝武帝大明"}, 
                {y:454, e:"[南北朝]宋孝武帝孝建"}, 
                {y:425, e:"[南北朝]宋文帝元嘉", offset:1}, 
                {y:424, e:"[南北朝]宋少帝景平二年/文帝元嘉元年", offset:-1}, 
                {y:423, e:"[南北朝]宋少帝景平元年", offset:-1}, 
                {y:421, e:"[南北朝]宋武帝永初", offset:1}, 
                {y:-99999, e:""}];
    }
    
    // Tang dynasty
    if (year >= 618 && year <= 705) {
        eras = [{y:1912, e:""}, 
                {y:705, e:"武周/唐中宗神龍元年", offset:-1}, 
                {y:702, e:"武周長安", offset:1}, 
                {y:701, e:"武周大足元年/長安元年", offset:-1}, 
                {y:700, e:"武周聖曆三年/久視元年", offset:-1}, 
                {y:698, e:"武周聖曆"},
                {y:697, e:"武周萬歲通天二年", offset:-1}, 
                {y:696, e:"武周萬歲登封元年/萬歲通天元年", offset:-1}, 
                {y:695, e:"武周証聖元年/天冊萬歲元年", offset:-1}, 
                {y:694, e:"武周長壽三年/延載元年", offset:-1}, 
                {y:693, e:"武周長壽二年", offset:-1}, 
                {y:692, e:"武周天授三年/如意元年/長壽元年", offset:-1}, 
                {y:691, e:"武周天授二年", offset:-1}, 
                {y:690, e:"唐睿宗載初二年/武周天授元年", offset:-1}, 
                {y:689, e:"唐睿宗永昌元年/載初元年", offset:-1}, 
                {y:685, e:"唐睿宗垂拱"}, 
                {y:684, e:"唐中宗嗣聖元年/睿宗文明元年/光宅元年", offset:-1}, 
                {y:683, e:"唐高宗永淳二年/弘道元年", offset:-1},
                {y:682, e:"唐高宗開耀二年/永淳元年", offset:-1},
                {y:681, e:"唐高宗永隆二年/開耀元年", offset:-1},
                {y:680, e:"唐高宗調露二年/永隆元年", offset:-1},
                {y:679, e:"唐高宗儀鳳四年/調露元年", offset:-1},
                {y:677, e:"唐高宗儀鳳", offset:1},
                {y:676, e:"唐高宗上元三年/儀鳳元年", offset:-1},
                {y:675, e:"唐高宗上元二年", offset:-1},
                {y:674, e:"唐高宗咸亨五年/上元元年", offset:-1},
                {y:671, e:"唐高宗咸亨", offset:1},
                {y:670, e:"唐高宗總章三年/咸亨元年", offset:-1},
                {y:669, e:"唐高宗總章二年", offset:-1},
                {y:668, e:"唐高宗乾封三年/總章元年", offset:-1},
                {y:666, e:"唐高宗乾封"}, {y:664, e:"唐高宗麟德"}, 
                {y:662, e:"唐高宗龍朔", offset:1}, 
                {y:661, e:"唐高宗顯慶六年/龍朔元年", offset:-1}, 
                {y:656, e:"唐高宗顯慶"}, {y:650, e:"唐高宗永徽"}, 
                {y:627, e:"唐太宗貞觀"}, {y:619, e:"唐高祖武德", offset:1},
                {y:618, e:"隋恭帝義寧二年/唐高祖武德元年", offset:-1},
                {y:-99999, e:""}];
    }
    if (year >= 706 && year < 907) {
        eras = [{y:1912, e:""}, 
                {y:905, e:"唐哀帝天祐", offset:1},
                {y:904, e:"唐昭宗天復四年/天祐元年", offset:-1},
                {y:902, e:"唐昭宗天復", offset:1},
                {y:901, e:"唐昭宗光化四年/天復元年", offset:-1},
                {y:899, e:"唐昭宗光化", offset:1},
                {y:898, e:"唐昭宗乾寧五年/光化元年", offset:-1},
                {y:894, e:"唐昭宗乾寧"}, {y:892, e:"唐昭宗景福"},
                {y:890, e:"唐昭宗大順"}, {y:889, e:"唐昭宗龍紀元年", offset:-1},
                {y:888, e:"唐僖宗光啟四年/文德元年", offset:-1}, 
                {y:886, e:"唐僖宗光啟", offset:1},
                {y:885, e:"唐僖宗中和五年/光啟元年", offset:-1},
                {y:882, e:"唐僖宗中和", offset:1},
                {y:881, e:"唐僖宗廣明二年/中和元年", offset:-1},
                {y:880, e:"唐僖宗廣明元年", offset:-1}, 
                {y:875, e:"唐僖宗乾符", offset:1},
                {y:874, e:"唐僖宗咸通十五/乾符元年", offset:-1},
                {y:861, e:"唐懿宗咸通", offset:1},
                {y:860, e:"唐懿宗大中十四年/咸通元年", offset:-1},
                {y:847, e:"唐宣宗大中"}, {y:841, e:"唐武宗會昌"}, 
                {y:836, e:"唐文宗開成"}, {y:828, e:"唐文宗大和", offset:1}, 
                {y:827, e:"唐敬宗寶曆三年/文宗大和元年", offset:-1},
                {y:825, e:"唐敬宗寶曆"}, {y:821, e:"唐穆宗長慶"}, 
                {y:806, e:"唐憲宗元和"}, 
                {y:805, e:"唐德宗貞元二十一年/順宗永貞元年", offset:-1},
                {y:785, e:"唐德宗貞元"}, {y:784, e:"唐德宗興元"}, 
                {y:780, e:"唐德宗建中"}, {y:767, e:"唐代宗大曆", offset:1}, 
                {y:766, e:"唐代宗永泰二年/大曆元年", offset:-1},
                {y:765, e:"唐代宗永泰元年", offset:-1}, 
                {y:764, e:"唐代宗廣德二年", offset:-1}, 
                {y:763, e:"唐肅宗寶應二年/代宗廣德元年", offset:-1}, 
                {y:762, e:"唐肅宗上元三年/寶應元年", offset:-1}, 
                {y:761, e:"唐肅宗上元二年", offset:-1}, 
                {y:760, e:"唐肅宗乾元三年/上元元年", offset:-1}, 
                {y:759, e:"唐肅宗乾元二年", offset:-1}, 
                {y:758, e:"唐肅宗至德三載/乾元元年", offset:-1}, 
                {y:757, e:"唐肅宗至德二載", offset:-1}, 
                {y:756, e:"唐玄宗天寶十五載/肅宗至德元載", offset:-1}, 
                {y:742, e:"唐玄宗天寶"}, {y:714, e:"唐玄宗開元", offset:1}, 
                {y:713, e:"唐玄宗先天二年/開元元年", offset:-1}, 
                {y:712, e:"唐睿宗太極元年/延和元年/玄宗先天元年", offset:-1}, 
                {y:711, e:"唐睿宗景雲二年", offset:-1}, 
                {y:710, e:"唐中宗景龍四年/殤帝唐隆元年/睿宗景雲元年", offset:-1}, 
                {y:708, e:"唐中宗景龍", offset:1}, 
                {y:707, e:"唐中宗神龍三年/景龍元年", offset:-1}, 
                {y:706, e:"唐中宗神龍二年", offset:-1}, 
                {y:-99999, e:""}];
        if (year > 743 && year < 758) { nian = "載";}
    }
    
    // Five dynasties
    if (year >= 907 && year <= 959 && region=='default') {
        eras = [{y:1912, e:""}, 
                {y:959, e:"[五代]後周世宗/恭帝顯德六年", offset:-1}, 
                {y:955, e:"[五代]後周世宗顯德", offset:1},
                {y:954, e:"[五代]後周太祖/世宗顯德元年", offset:-1}, 
                {y:951, e:"[五代]後周太祖廣順"}, 
                {y:949, e:"[五代]後漢隱帝乾祐", offset:1}, 
                {y:948, e:"[五代]後漢高祖/隱帝乾祐元年", offset:-1}, 
                {y:947, e:"[五代]後漢高祖天福十二年", offset:-1}, 
                {y:945, e:"[五代]後晋出帝開運", offset:1}, 
                {y:944, e:"[五代]後晋出帝天福九年/開運元年", offset:-1}, 
                {y:942, e:"[五代]後晋出帝天福", offset:6}, 
                {y:937, e:"[五代]後晋高祖天福", offset:1}, 
                {y:936, e:"[五代]後唐清泰三年/後晋高祖天福元年", offset:-1}, 
                {y:935, e:"[五代]後唐清泰二年", offset:-1},
                {y:934, e:"[五代]後唐閔帝應順元年/李從珂清泰元年", offset:-1},
                {y:931, e:"[五代]後唐明宗長興", offset:1}, 
                {y:930, e:"[五代]後唐明宗天成五年/長興元年", offset:-1}, 
                {y:927, e:"[五代]後唐明宗天成", offset:1}, 
                {y:926, e:"[五代]後唐莊宗同光四年/明宗天成元年", offset:-1}, 
                {y:924, e:"[五代]後唐莊宗同光", offset:1}, 
                {y:923, e:"[五代]後梁末帝龍德三年/後唐莊宗同光元年", offset:-1}, 
                {y:922, e:"[五代]後梁末帝龍德二年", offset:-1}, 
                {y:921, e:"[五代]後梁末帝貞明七年/龍德元年", offset:-1}, 
                {y:916, e:"[五代]後梁末帝貞明", offset:1}, 
                {y:915, e:"[五代]後梁末帝乾化五年/貞明元年", offset:-1}, 
                {y:914, e:"[五代]後梁末帝乾化四年", offset:-1}, 
                {y:913, e:"[五代]後梁鳳曆元年/末帝乾化三年", offset:-1}, 
                {y:912, e:"[五代]後梁太祖乾化二年", offset:-1}, 
                {y:911, e:"[五代]後梁太祖開平五年/乾化元年", offset:-1}, 
                {y:908, e:"[五代]後梁太祖開平", offset:1}, 
                {y:907, e:"唐哀帝天祐四年/[五代]後梁太祖開平元年", offset:-1},
                {y:-99999, e:""}];
    }
    
    // Northern Song dynasty
    if (year >= 960 && year <= 1126 && region=='default') {
        eras = [{y:1912, e:""}, 
                {y:1126, e:"宋欽宗靖康元年", offset:-1}, 
                {y:1120, e:"宋徽宗宣和", offset:1}, 
                {y:1119, e:"宋徽宗重和二年/宣和元年", offset:-1}, 
                {y:1118, e:"宋徽宗政和八年/重和元年", offset:-1}, 
                {y:1111, e:"宋徽宗政和"}, {y:1107, e:"宋徽宗大觀"}, 
                {y:1102, e:"宋徽宗崇寧"}, {y:1101, e:"宋徽宗建中靖國"}, 
                {y:1099, e:"宋哲宗元符", offset:1}, 
                {y:1098, e:"宋哲宗紹聖五年/元符元年", offset:-1}, 
                {y:1095, e:"宋哲宗紹聖", offset:1}, 
                {y:1094, e:"宋哲宗元祐九年/紹聖元年", offset:-1}, 
                {y:1086, e:"宋哲宗元祐"}, {y:1078, e:"宋神宗元豐"}, 
                {y:1068, e:"宋神宗熙寧"}, {y:1064, e:"宋英宗治平"}, 
                {y:1057, e:"宋仁宗嘉祐", offset:1}, 
                {y:1056, e:"宋仁宗至和三年/嘉祐元年", offset:-1},
                {y:1055, e:"宋仁宗至和二年", offset:-1},
                {y:1054, e:"宋仁宗皇祐六年/至和元年", offset:-1}, 
                {y:1049, e:"宋仁宗皇祐"}, 
                {y:1042, e:"宋仁宗慶曆", offset:1}, 
                {y:1041, e:"宋仁宗康定二年/慶曆元年", offset:-1}, 
                {y:1040, e:"宋仁宗寶元三年/康定元年", offset:-1}, 
                {y:1039, e:"宋仁宗寶元二年", offset:-1}, 
                {y:1038, e:"宋仁宗景祐五年/寶元元年", offset:-1}, 
                {y:1034, e:"宋仁宗景祐"}, 
                {y:1033, e:"宋仁宗明道二年", offset:-1}, 
                {y:1032, e:"宋仁宗天聖十年/明道元年", offset:-1}, 
                {y:1023, e:"宋仁宗天聖"}, {y:1022, e:"宋真宗乾興"}, 
                {y:1017, e:"宋真宗天禧"}, {y:1008, e:"宋真宗大中祥符"}, 
                {y:1004, e:"宋真宗景德"}, {y:998, e:"宋真宗咸平"}, 
                {y:995, e:"宋太宗至道"}, {y:990, e:"宋太宗淳化"}, 
                {y:988, e:"宋太宗端拱"}, {y:985, e:"宋太宗雍熙", offset:1}, 
                {y:984, e:"宋太宗太平興國九年/雍熙元年", offset:-1}, 
                {y:977, e:"宋太宗太平興國", offset:1}, 
                {y:976, e:"宋太祖開寶九年/太宗太平興國元年", offset:-1}, 
                {y:969, e:"宋太祖開寶", offset:1},
                {y:968, e:"宋太祖乾德六年/開寶元年", offset:-1}, 
                {y:964, e:"宋太祖乾德", offset:1},
                {y:963, e:"宋太祖建隆四年/乾德元年", offset:-1}, 
                {y:961, e:"宋太祖建隆", offset:1}, 
                {y:960, e:"[五代]後周恭帝顯德七年/宋太祖建隆元年", offset:-1}, 
                {y:-99999, e:""}];
    }
    
    // Southern Song dynasty
    if (year >= 1127 && year <= 1279 && region=='default') {
        eras = [{y:1912, e:""}, 
                {y:1279, e:"宋帝昺祥興二年/元世祖至元十六年", offset:-1},
                {y:1278, e:"宋端宗景炎三年/帝昺祥興元年", offset:-1},
                {y:1277, e:"宋端宗景炎二年", offset:-1},
                {y:1276, e:"宋恭帝德祐二年/端宗景炎元年", offset:-1},
                {y:1275, e:"宋恭帝德祐元年", offset:-1},
                {y:1265, e:"宋度宗咸淳"}, {y:1260, e:"宋理宗景定"}, 
                {y:1259, e:"宋理宗開慶"}, {y:1253, e:"宋理宗寶祐"},
                {y:1241, e:"宋理宗淳祐"}, {y:1237, e:"宋理宗嘉熙"}, 
                {y:1234, e:"宋理宗端平"}, {y:1228, e:"宋理宗紹定"}, 
                {y:1225, e:"宋理宗寶慶"}, {y:1208, e:"宋寧宗嘉定"}, 
                {y:1205, e:"宋寧宗開禧"}, {y:1201, e:"宋寧宗嘉泰"}, 
                {y:1195, e:"宋寧宗慶元"}, {y:1190, e:"宋光宗紹熙"}, 
                {y:1174, e:"宋孝宗淳熙"}, {y:1165, e:"宋孝宗乾道"}, 
                {y:1163, e:"宋孝宗隆興"}, {y:1131, e:"宋高宗紹興"}, 
                {y:1128, e:"宋高宗建炎", offset:1},
                {y:1127, e:"宋欽宗靖康二年/宋高宗建炎元年", offset:-1}, 
                {y:-99999, e:""}];
    }
    
    // Liao, Jin and Yuan dynasty (946-1280)
    if (year > 945.5 && year < 1280.5 && region=='LiaoJinYuan') {
        eras = [{y:1912, e:""}, {y:1265, e:"元世祖至元", offset:1},
                {y:1264, e:"元世祖中統五年/至元元年", offset:-1},
                {y:1260, e:"元世祖中統"}, {y:1251, e:"元憲宗"},
                {y:1249, e:"元定宗后"}, {y:1246, e:"元定宗"},
                {y:1242, e:"元太宗后"}, {y:1235, e:"元太宗", offset:6},
                {y:1234, e:"金哀宗天興三年/元太宗六年", offset:-1},
                {y:1232, e:"金哀宗天興"}, {y:1224, e:"金哀宗正大"},
                {y:1223, e:"金宣宗元光二年", offset:-1},
                {y:1222, e:"金宣宗興定六年/元光元年", offset:-1},
                {y:1218, e:"金宣宗興定", offset:1}, 
                {y:1217, e:"金宣宗貞祐五年/興定元年", offset:-1},
                {y:1214, e:"金宣宗貞祐", offset:1}, 
                {y:1213, e:"金崇慶二年/至寧/貞祐元年", offset:-1},
                {y:1212, e:"金崇慶元年", offset:-1}, 
                {y:1209, e:"金大安"}, {y:1201, e:"金章宗泰和"}, 
                {y:1197, e:"金章宗承安", offset:1},
                {y:1196, e:"金章宗明昌七年/承安元年", offset:-1},
                {y:1190, e:"金章宗明昌"}, 
                {y:1162, e:"金世宗大定", offset:1},
                {y:1161, e:"金正隆六年/大定元年", offset:-1},
                {y:1157, e:"金正隆", offset:1}, 
                {y:1156, e:"金貞元四年/正隆元年", offset:-1},
                {y:1154, e:"金貞元", offset:1}, 
                {y:1153, e:"金天德五年/貞元元年", offset:-1},
                {y:1150, e:"金天德", offset:1}, 
                {y:1149, e:"金皇統九年/天德元年", offset:-1},
                {y:1141, e:"金熙宗皇統"}, {y:1138, e:"金熙宗天眷"},
                {y:1135, e:"金熙宗天會", offset:12},
                {y:1126, e:"金太宗天會", offset:3}, 
                {y:1125, e:"遼天祚帝保大五年/金太宗天會三年", offset:-1},
                {y:1121, e:"遼天祚帝保大"}, {y:1111, e:"遼天祚帝天慶"},
                {y:1102, e:"遼天祚帝乾統", offset:1}, 
                {y:1101, e:"遼道宗壽昌七年/天祚帝乾統元年", offset:-1},
                {y:1095, e:"遼道宗壽昌"}, {y:1085, e:"遼道宗大安"},
                {y:1075, e:"遼道宗大康"}, {y:1065, e:"遼道宗咸雍"},
                {y:1056, e:"遼道宗清寧", offset:1}, 
                {y:1055, e:"遼興宗重熙廿四年/道宗清寧元年", offset:-1},
                {y:1033, e:"遼興宗重熙", offset:1}, 
                {y:1032, e:"遼興宗景福二年/重熙元年", offset:-1},
                {y:1031, e:"遼聖宗太平十一年/興宗景福元年", offset:-1},
                {y:1022, e:"遼聖宗太平", offset:1}, 
                {y:1021, e:"遼聖宗開泰十年/太平元年", offset:-1},
                {y:1013, e:"遼聖宗開泰", offset:1}, 
                {y:1012, e:"遼聖宗統和三十年/開泰元年", offset:-1},
                {y:984, e:"遼聖宗統和", offset:1}, 
                {y:983, e:"遼聖宗乾亨五年/統和元年", offset:-1},
                {y:980, e:"遼景宗乾亨", offset:1}, 
                {y:979, e:"遼景宗保寧十一年/乾亨元年", offset:-1},
                {y:970, e:"遼景宗保寧", offset:1}, 
                {y:969, e:"遼穆宗應曆十九年/景宗保寧元年", offset:-1},
                {y:952, e:"遼穆宗應曆", offset:1}, 
                {y:951, e:"遼世宗天祿五年/穆宗應曆元年", offset:-1},
                {y:948, e:"遼世宗天祿", offset:1}, 
                {y:947, e:"遼太宗會同十年/大同元年/世宗天祿元年", offset:-1},
                {y:939, e:"遼太宗會同", offset:1},
                {y:-99999, e:""}];
    }
    
    // Yuan dynasty
    if (year >=1280 && year <=1367) {
        eras = [{y:1912, e:""}, {y:1341, e:"元順帝至正"},
                {y:1336, e:"元順帝至元", offset:1}, 
                {y:1335, e:"元順帝元統三年/至元元年", offset:-1},
                {y:1334, e:"元順帝元統二年", offset:-1},
                {y:1333, e:"元順帝至順四年/元統元年", offset:-1},
                {y:1332, e:"元文宗/寧宗/順帝至順三年", offset:-1},
                {y:1331, e:"元文宗至順二年", offset:-1},
                {y:1330, e:"元文宗天曆三年/至順元年", offset:-1},
                {y:1329, e:"元文宗/明宗天曆二年", offset:-1},
                {y:1328, e:"元泰定帝泰定五年/致和元年/元天順帝天順元年/元文宗天曆元年", offset:-1},
                {y:1324, e:"元泰定帝泰定"}, {y:1321, e:"元英宗至治"},
                {y:1314, e:"元仁宗延祐"}, {y:1312, e:"元仁宗皇慶"},
                {y:1308, e:"元武宗至大"}, {y:1298, e:"元成宗大德", offset:1}, 
                {y:1297, e:"元成宗元貞三年/大德元年", offset:-1}, 
                {y:1295, e:"元成宗元貞"}, {y:1264, e:"元世祖至元"},
                {y:-99999, e:""}];
    }
    
    // Ming dynasty
    if (year >= 1368 && year <= 1644) {
        eras = [{y:1912, e:""}, 
                {y:1644, e:"明思宗崇禎十七年/清世祖順治元年", offset:-1}, 
                {y:1628, e:"明思宗崇禎"}, 
                {y:1621, e:"明熹宗天啟"}, {y:1620, e:"明神宗萬曆四十八年/明光宗泰昌元年", offset:-1}, 
                {y:1573, e:"明神宗萬曆"}, {y:1567, e:"明穆宗隆慶"},
                {y:1522, e:"明世宗嘉靖"}, {y:1506, e:"明武宗正德"},
                {y:1488, e:"明孝宗弘治"}, {y:1465, e:"明憲宗成化"},
                {y:1457, e:"明英宗天順"}, {y:1450, e:"明代宗景泰"},
                {y:1436, e:"明英宗正統"}, {y:1426, e:"明宣宗宣德"},
                {y:1425, e:"明仁宗洪熙"}, {y:1403, e:"明成祖永樂"},
                {y:1402, e:"明惠帝建文四年/明成祖洪武三十五年", offset:-1},
                {y:1399, e:"明惠帝建文"}, {y:1369, e:"明太祖洪武", offset:1},
                {y:1368, e:"元順帝至正二十八年/明太祖洪武元年", offset:-1},
                {y:-99999, e:""}];
    }
    
    // Qing dynasty
    if (year >= 1645 && year <= 1911) {
        eras = [{y:1912, e:""}, {y:1909, e:"清宣統"}, 
           {y:1875, e:"清德宗光緒"}, {y:1862, e:"清穆宗同治"}, 
           {y:1851, e:"清文宗咸豐"}, {y:1821, e:"清宣宗道光"}, 
           {y:1796, e:"清仁宗嘉慶"}, {y:1736, e:"清高宗乾隆"},
           {y:1723, e:"清世宗雍正"}, {y:1662, e:"清聖祖康熙"},
           {y:1644, e:"清世祖順治"}, {y:-99999, e:""}];
    }

    // Southern Ming and Zheng dynasty
    if (year >= 1644 && year <= 1685 && region=='SouthernMing') {
        eras = [{y:1912, e:""}, {y:1662, e:"明鄭永曆", offset:15}, {y:1654, e:"南明永曆", offset:7},
        {y:1653, e:"南明永曆七年/魯王監國八年", offset:-1}, {y:1652, e:"南明永曆六年/魯王監國七年", offset:-1},
        {y:1651, e:"南明永曆五年/魯王監國六年", offset:-1}, {y:1650, e:"南明永曆四年/魯王監國五年", offset:-1},
        {y:1649, e:"南明永曆三年/魯王監國四年", offset:-1}, {y:1648, e:"南明永曆二年/魯王監國三年", offset:-1},
        {y:1647, e:"南明永曆元年/魯王監國二年", offset:-1}, {y:1646, e:"南明隆武二年/魯王監國元年", offset:-1},
        {y:1645, e:"南明弘光元年/隆武元年", offset:-1}, {y:1628, e:"明崇禎"}];
    }
    
    let chineseNumbers = ["一","二","三","四","五","六","七","八","九","十"];
    let n = eras.length;
    let era="";
    for (let i=0; i<n; i++) {
        if (year >= eras[i].y) {
            if (eras[i].e != "") {
                era = "("+eras[i].e;
                let offset = ('offset' in eras[i] ? eras[i].offset:0);
                let ey = year - eras[i].y + 1 + offset;
                if (offset >= 0) {
                    if (ey==1) {
                        era += "元"+nian+")";
                    } else if (ey < 11) {
                        era += chineseNumbers[ey-1]+nian+")";
                    } else if (ey < 20) {
                        era += chineseNumbers[9]+chineseNumbers[ey-11] + nian + ")";
                    } else {
                        let i1 = Math.floor(ey*0.1);
                        let i0 = ey - 10*i1;
                        era += chineseNumbers[i1-1]+chineseNumbers[9];
                        if (i0 > 0) {
                            era += chineseNumbers[i0-1];
                        }
                        era += nian+")";
                    }
                } else {
                    era += ")";
                }
            }
            break;
        }
    }
    return era;
}

function eraNameSim(year, region, li=null) {
    // set up an array of objects to store era name information
    let eras = [{y:1912, e:""}, {y:-99999, e:""}];
    let nian = "年";
    let zhou, lu, zhuanxu, chunqiu, shown;
    
    //Spring and Autumn period
    if (year >= -722 && year <=-480) {
        if (year >= -722 && year <=-480) {
            if (li===null) {
                shown = (document.getElementById("Spring").style.display == "block");
                zhou = document.getElementById('zhouSpring').classList.contains('active') && shown;
                chunqiu = document.getElementById('chunqiuSpring').classList.contains('active') && shown;
            } else {
                zhou = (li=='Zhou');
                chunqiu = (li=='Chunqiu');
            }
        }
        
        // Zhou calendar
        if (zhou) {
            eras = [{y:1912, e:""}, 
                    {y:-518, e:"周敬王"}, {y:-543, e:"周景王"}, {y:-570, e:"周灵王"}, 
                    {y:-584, e:"周简王"}, {y:-605, e:"周定王"}, {y:-611, e:"周匡王"}, 
                    {y:-617, e:"周顷王"}, {y:-650, e:"周襄王"}, {y:-675, e:"周惠王"}, 
                    {y:-680, e:"周僖王"}, {y:-695, e:"周庄王"}, {y:-718, e:"周桓王"}, 
                    {y:-771, e:"周平王"}, {y:-99999, e:""}];
        }
        
        // Chunqiu calendar
        if (chunqiu) {
            eras = [{y:1912, e:""}, 
                    {y:-493, e:"鲁哀公"}, {y:-508, e:"鲁定公"}, {y:-540, e:"鲁昭公"}, 
                    {y:-571, e:"鲁襄公"}, {y:-589, e:"鲁成公"}, {y:-607, e:"鲁宣公"}, 
                    {y:-625, e:"鲁文公"}, {y:-658, e:"鲁僖公"}, {y:-660, e:"鲁闵公"}, 
                    {y:-692, e:"鲁庄公"}, {y:-710, e:"鲁桓公"}, {y:-721, e:"鲁隐公"}, 
                    {y:-767, e:"鲁惠公"}, {y:-99999, e:""}];
        }
    }
    
    //Warring States period
    if (year >= -479 && year <=-221) {
        if (li===null) {
            shown = (document.getElementById("Warring").style.display == "block");
            if (shown) {
                zhou = document.getElementById('zhouWarring').classList.contains('active');
                lu = document.getElementById('luWarring').classList.contains('active');
                zhuanxu = document.getElementById('zhuanxuWarring').classList.contains('active');
            } else {
                zhou = document.getElementById('zhouSpring').classList.contains('active');
                lu = document.getElementById('chunqiuSpring').classList.contains('active');
                zhuanxu = (document.getElementById("Spring").style.display=="none");
            }
        } else {
            zhou = (li=='Zhou');
            lu = (li=='Lu' || li=='Chunqiu');
            zhuanxu = (li=='Zhuanxu');
        }
        
        // Zhou calendar
        if (zhou) {
            eras = [{y:-254, e:""}, 
                    {y:-313, e:"周赧王"}, {y:-319, e:"周慎靓王"}, 
                    {y:-367, e:"周显圣王"}, {y:-374, e:"周夷烈王"}, 
                    {y:-400, e:"周元安王"}, {y:-424, e:"周威烈王"}, 
                    {y:-439, e:"周考哲王"}, {y:-467, e:"周贞定王"}, 
                    {y:-475, e:"周元王"}, {y:-518, e:"周敬王"}, 
                    {y:-99999, e:""}];
        }
        
        // Lu calendar 
        if (lu) {
            eras = [{y:-247, e:""}, 
                    {y:-271, e:"鲁顷公"}, {y:-294, e:"鲁文公"}, {y:-313, e:"鲁平公"}, 
                    {y:-342, e:"鲁景公"}, {y:-351, e:"鲁康公"}, {y:-375, e:"鲁共公"}, 
                    {y:-406, e:"鲁穆公"}, {y:-427, e:"鲁元公"}, {y:-465, e:"鲁悼公"}, 
                    {y:-493, e:"鲁哀公"}, {y:-99999, e:""}];
        }
        
        // Zhuanxu calendar
        if (zhuanxu) {
            eras = [{y:1912, e:""}, 
                    {y:-245, e:"秦王政"}, {y:-248, e:"秦庄襄王"}, {y:-249, e:"秦孝文王"}, 
                    {y:-305, e:"秦昭襄王"}, {y:-306, e:""}];
        }
    }
    
    if (year==-220) {
        if (li===null) {
            shown = (document.getElementById("Warring").style.display == "block");
            zhuanxu = document.getElementById('zhuanxuWarring').classList.contains('active');
            if (!shown || (shown && zhuanxu)) {
                eras = [{y:-220, e:"秦始皇二十六年", offset:-1}];
            }
        } else {
            if (li=='Zhuanxu') {
                eras = [{y:-220, e:"秦始皇二十六年", offset:-1}];
            }
        }
    }
    
    // Qin, Western Han and Xin dynasties
    if (year > -220 && year <=25) {
        eras = [{y:1912, e:""}, 
                    {y:25, e:"汉更始三年/光武帝建武元年", offset:-1},
                    {y:24, e:"汉更始二年", offset:-1},
                    {y:23, e:"新地皇四年/汉更始元年", offset:-1}, 
                    {y:20, e:"新地皇"}, {y:14, e:"新天凤"}, 
                    {y:9, e:"新始建国"}, 
                    {y:8, e:"汉居摄三年/初始元年", offset:-1}, 
                    {y:6, e:"汉居摄"}, {y:1, e:"汉平帝元始"}, 
                    {y:-1, e:"汉哀帝元寿"}, {y:-5, e:"汉哀帝建平"}, 
                    {y:-7, e:"汉成帝绥和"}, {y:-11, e:"汉成帝元延"}, 
                    {y:-15, e:"汉成帝永始"}, {y:-19, e:"汉成帝鸿嘉"}, 
                    {y:-23, e:"汉成帝阳朔"}, 
                    {y:-26, e:"汉成帝河平", offset:1}, 
                    {y:-27, e:"汉成帝建始五年/河平元年", offset:-1}, 
                    {y:-31, e:"汉成帝建始"}, {y:-32, e:"汉元帝竟宁"}, 
                    {y:-37, e:"汉元帝建昭"}, {y:-42, e:"汉元帝永光"}, 
                    {y:-47, e:"汉元帝初元"}, {y:-48, e:"汉宣帝黄龙"}, 
                    {y:-52, e:"汉宣帝甘露"}, {y:-56, e:"汉宣帝五凤"}, 
                    {y:-59, e:"汉宣帝神爵", offset:1}, 
                    {y:-60, e:"汉宣帝元康五年/神爵元年", offset:-1},
                    {y:-64, e:"汉宣帝元康"}, {y:-68, e:"汉宣帝地节"}, 
                    {y:-72, e:"汉宣帝本始"}, {y:-73, e:"汉昭帝元平"}, 
                    {y:-78, e:"汉昭帝元凤", offset:1}, 
                    {y:-79, e:"汉昭帝始元七年/元凤元年", offset:-1}, 
                    {y:-85, e:"汉昭帝始元"}, {y:-87, e:"汉武帝后元"}, 
                    {y:-91, e:"汉武帝征和"}, {y:-95, e:"汉武帝太始"}, 
                    {y:-99, e:"汉武帝天汉"}, {y:-103, e:"汉武帝太初"}, 
                    {y:-109, e:"汉武帝元封"}, {y:-115, e:"汉武帝元鼎"},
                    {y:-121, e:"汉武帝元狩"}, {y:-127, e:"汉武帝元朔"}, 
                    {y:-133, e:"汉武帝元光"}, {y:-139, e:"汉武帝建元"}, 
                    {y:-142, e:"汉景帝后元"}, {y:-148, e:"汉景帝中元"}, 
                    {y:-155, e:"汉景帝前元"}, {y:-162, e:"汉文帝后元"}, 
                    {y:-178, e:"汉文帝前元"}, {y:-186, e:"汉高后"}, 
                    {y:-193, e:"汉惠帝"}, {y:-205, e:"汉高祖"}, 
                    {y:-208, e:"秦二世"}, {y:-245, e:"秦始皇"}, 
                    {y:-99999, e:""}];
    }
 
    // Eastern Han dynasty
    if (year > 25 && year <= 220) {
        eras = [{y:1912, e:""}, 
                {y:220, e:"汉献帝建安二十五年/延康元年/魏文帝黄初元年", offset:-1}, 
                {y:196, e:"汉献帝建安"}, {y:194, e:"汉献帝兴平"}, 
                {y:190, e:"汉献帝初平"}, {y:185, e:"汉灵帝中平", offset:1}, 
                {y:184, e:"汉灵帝光和七年/中平元年", offset:-1}, 
                {y:179, e:"汉灵帝光和", offset:1}, 
                {y:178, e:"汉灵帝熹平七年/光和元年", offset:-1}, 
                {y:173, e:"汉灵帝熹平", offset:1}, 
                {y:172, e:"汉灵帝建宁五年/熹平元年", offset:-1}, 
                {y:168, e:"汉灵帝建宁"}, 
                {y:167, e:"汉桓帝延熹十年/永康元年", offset:-1}, 
                {y:159, e:"汉桓帝延熹", offset:1}, 
                {y:158, e:"汉桓帝永寿四年/延熹元年", offset:-1}, 
                {y:155, e:"汉桓帝永寿"}, 
                {y:154, e:"汉桓帝永兴二年", offset:-1}, 
                {y:153, e:"汉桓帝元嘉三年/永兴元年", offset:-1}, 
                {y:151, e:"汉桓帝元嘉"}, {y:150, e:"汉桓帝和平"}, 
                {y:147, e:"汉桓帝建和"}, {y:146, e:"汉质帝本初"}, 
                {y:145, e:"汉冲帝永嘉"}, 
                {y:144, e:"汉顺帝汉安三年/建康元年", offset:-1}, 
                {y:142, e:"汉顺帝汉安"}, {y:136, e:"汉顺帝永和"}, 
                {y:133, e:"汉顺帝阳嘉", offset:1}, 
                {y:132, e:"汉顺帝永建七年/阳嘉元年", offset:-1}, 
                {y:126, e:"汉顺帝永建"}, {y:123, e:"汉安帝延光", offset:1}, 
                {y:122, e:"汉安帝建光二年/延光元年", offset:-1}, 
                {y:121, e:"汉安帝永宁二年/建光元年", offset:-1}, 
                {y:120, e:"汉安帝元初七年/永宁元年", offset:-1}, 
                {y:114, e:"汉安帝元初"}, {y:107, e:"汉安帝永初"}, 
                {y:106, e:"汉殇帝延平元年", offset:-1}, 
                {y:105, e:"汉和帝永元十七年/元兴元年", offset:-1}, 
                {y:89, e:"汉和帝永元"}, 
                {y:88, e:"汉章帝章和二年", offset:-1}, 
                {y:87, e:"汉章帝元和四年/章和元年", offset:-1}, 
                {y:85, e:"汉章帝元和", offset:1}, 
                {y:84, e:"汉章帝建初九年/元和元年", offset:-1}, 
                {y:76, e:"汉章帝建初"}, {y:58, e:"汉明帝永平"}, 
                {y:57, e:"汉光武帝建武中元二年", offset:-1}, 
                {y:56, e:"汉光武帝建武三十二年/建武中元元年", offset:-1}, 
                {y:26, e:"汉光武帝建武", offset:1}, 
                {y:-99999, e:""}];
    }
    
    // Wei and Jin dynasties
    if (year > 220 && year <= 420 && region=='default') {
        eras = [{y:1912, e:""}, 
                {y:420, e:"晋恭帝元熙二年/[南北朝]宋武帝永初元年", offset:-1},
                {y:419, e:"晋恭帝元熙元年", offset:-1}, 
                {y:405, e:"晋安帝义熙"}, {y:403, e:"晋安帝元兴", offset:1}, 
                {y:402, e:"晋安帝元兴元年/大亨元年", offset:-1}, 
                {y:397, e:"晋安帝隆安"}, {y:376, e:"晋孝武帝太元"}, 
                {y:373, e:"晋孝武帝宁康"}, 
                {y:372, e:"晋简文帝咸安二年", offset:-1},
                {y:371, e:"晋废帝太和六年/简文帝咸安元年", offset:-1}, 
                {y:366, e:"晋废帝太和"}, {y:364, e:"晋哀帝兴宁", offset:1}, 
                {y:363, e:"晋哀帝隆和二年/兴宁元年", offset:-1}, 
                {y:362, e:"晋哀帝隆和元年", offset:-1}, 
                {y:357, e:"晋穆帝升平"}, {y:345, e:"晋穆帝永和"}, 
                {y:343, e:"晋康帝建元"}, {y:335, e:"晋成帝咸康"}, 
                {y:327, e:"晋成帝咸和", offset:1}, 
                {y:326, e:"晋明帝太宁四年/成帝咸和元年", offset:-1}, 
                {y:324, e:"晋明帝太宁", offset:1},
                {y:323, e:"晋明帝永昌二年/太宁元年", offset:-1},
                {y:322, e:"晋元帝永昌元年", offset:-1},
                {y:319, e:"晋元帝大兴", offset:1},
                {y:318, e:"晋元帝建武二年/大兴元年", offset:-1},
                {y:317, e:"晋愍帝建兴五年/元帝建武元年", offset:-1},
                {y:314, e:"晋愍帝建兴", offset:1}, 
                {y:313, e:"晋怀帝永嘉七年/愍帝建兴元年", offset:-1}, 
                {y:307, e:"晋怀帝永嘉"}, 
                {y:306, e:"晋惠帝永兴三年/光熙元年", offset:-1}, 
                {y:305, e:"晋惠帝永兴二年", offset:-1}, 
                {y:304, e:"晋惠帝永安/建武/永兴元年", offset:-1}, 
                {y:303, e:"晋惠帝太安二年", offset:-1}, 
                {y:302, e:"晋惠帝永宁二年/太安元年", offset:-1}, 
                {y:301, e:"晋惠帝永康二年/永宁元年", offset:-1}, 
                {y:300, e:"晋惠帝永康元年", offset:-1}, 
                {y:292, e:"晋惠帝元康", offset:1}, 
                {y:291, e:"晋惠帝永平元年/元康元年", offset:-1}, 
                {y:290, e:"晋武帝太熙元年/惠帝永熙元年", offset:-1}, 
                {y:281, e:"晋武帝太康", offset:1}, 
                {y:280, e:"晋武帝咸宁六年/太康元年", offset:-1}, 
                {y:275, e:"晋武帝咸宁"}, {y:266, e:"晋武帝泰始", offset:1}, 
                {y:265, e:"魏元帝咸熙二年/晋武帝泰始元年", offset:-1}, 
                {y:264, e:"魏元帝景元五年/咸熙元年", offset:-1}, 
                {y:261, e:"魏元帝景元", offset:1}, 
                {y:260, e:"魏甘露五年/元帝景元元年", offset:-1}, 
                {y:257, e:"魏甘露", offset:1}, 
                {y:256, e:"魏正元三年/甘露元年", offset:-1}, 
                {y:255, e:"魏正元二年", offset:-1}, 
                {y:254, e:"魏嘉平六年/正元元年", offset:-1}, 
                {y:250, e:"魏嘉平", offset:1}, 
                {y:249, e:"魏正始十年/嘉平元年", offset:-1}, 
                {y:240, e:"魏正始"}, {y:238, e:"魏明帝景初", offset:1}, 
                {y:237, e:"魏明帝青龙五年/景初元年", offset:-1}, 
                {y:234, e:"魏明帝青龙", offset:1}, 
                {y:233, e:"魏明帝太和七年/青龙元年", offset:-1}, 
                {y:227, e:"魏明帝太和"}, {y:221, e:"魏文帝黄初", offset:1}, 
                {y:-99999, e:""}];
    }

    // Shu dynasty
    if (region=='Shu' && year >= 221 && year <= 263) {
        eras = [{y:1912, e:""}, 
                {y:264, e:"魏元帝景元五年/咸熙元年", offset:-1},
                {y:263, e:"蜀后主景耀六年/炎兴元年", offset:-1},
                {y:258, e:"蜀后主景耀"}, {y:238, e:"蜀后主延熙"},
                {y:224, e:"蜀后主建兴", offset:1}, 
                {y:223, e:"蜀昭烈帝章武三年/后主建兴元年", offset:-1},
                {y:221, e:"蜀昭烈帝章武"},
                {y:-99999, e:""}];
    }
    
    // Wu dynasty
    if (region=='Wu' && year >= 222 && year <= 280) {
        eras = [{y:1912, e:""}, 
                {y:281, e:"晋武帝太康", offset:1}, {y:277, e:"吴天纪"},
                {y:276, e:"吴天册二年/天玺元年", offset:-1}, 
                {y:275, e:"吴天册元年", offset:-1},
                {y:272, e:"吴凤凰"}, {y:270, e:"吴建衡", offset:1}, 
                {y:269, e:"吴宝鼎四年/建衡元年", offset:-1},
                {y:267, e:"吴宝鼎", offset:1}, 
                {y:266, e:"吴甘露二年/宝鼎元年", offset:-1},
                {y:265, e:"吴元兴二年/甘露元年", offset:-1}, 
                {y:264, e:"吴永安七年/元兴元年", offset:-1},
                {y:259, e:"吴景帝永安", offset:1}, 
                {y:258, e:"吴太平三年/永安元年", offset:-1},
                {y:257, e:"吴太平二年", offset:-1}, 
                {y:256, e:"吴五凤三年/太平元年", offset:-1},
                {y:254, e:"吴五凤"}, {y:253, e:"吴建兴二年", offset:-1},
                {y:252, e:"吴太元二年/神凤元年/建兴元年", offset:-1},
                {y:251, e:"吴大帝赤乌十四年/太元元年", offset:-1},
                {y:239, e:"吴大帝赤乌", offset:1}, 
                {y:238, e:"吴大帝嘉禾七年/赤乌元年", offset:-1},
                {y:232, e:"吴大帝嘉禾"}, {y:230, e:"吴大帝黄龙", offset:1},
                {y:229, e:"吴大帝黄武八年/黄龙元年", offset:-1},
                {y:222, e:"吴大帝黄武"},
                {y:-99999, e:""}];
    }
    
   // Later Qin
    if (year > 383.5 && year < 417.5 && region=='LaterQin') {
        eras = [{y:1912, e:""}, {y:417, e:"后秦永和二年", offset:-1},
                {y:416, e:"后秦弘始十八年/永和元年", offset:-1},
                {y:400, e:"后秦文桓帝弘始", offset:1}, 
                {y:399, e:"后秦文桓帝皇初六年/弘始元年", offset:-1},
                {y:395, e:"后秦文桓帝皇初", offset:1},
                {y:394, e:"后秦武昭帝建初九年/文桓帝皇初元年", offset:-1},
                {y:387, e:"后秦武昭帝建初", offset:1},
                {y:386, e:"后秦武昭帝白雀三年/建初元年", offset:-1}, 
                {y:384, e:"后秦武昭帝白雀"},
                {y:-99999, e:""}];
    }
    
    // Northern Liang
    if (year > 410.5 && year < 439.5 && region=='NorthernLiang') {
        eras = [{y:1912, e:""}, {y:434, e:"北凉承和", offset:1},
                {y:433, e:"北凉义和三年/承和元年", offset:-1},
                {y:432, e:"北凉义和二年", offset:-1}, 
                {y:431, e:"北凉承玄四年/义和元年", offset:-1},
                {y:429, e:"北凉承玄", offset:1}, 
                {y:428, e:"北凉玄始十七年/承玄元年", offset:-1},
                {y:413, e:"北凉玄始", offset:1}, 
                {y:412, e:"北凉永安十二年/玄始元年", offset:-1},
                {y:402, e:"北凉永安", offset:1}, 
                {y:401, e:"北凉天玺三年/永安元年", offset:-1},
                {y:400, e:"北凉天玺二年", offset:-1}, 
                {y:399, e:"北凉神玺三年/天玺元年", offset:-1},
                {y:397, e:"北凉神玺"}, {y:-99999, e:""}];
    }
    
    // Northern Wei, Western Wei, Northern Zhou and Sui
    if (year > 385.5 && year < 590.5 && region=='WeiZhouSui') {
        eras = [{y:1912, e:""}, {y:581, e:"隋文帝开皇"},
                {y:579, e:"北周静帝大象"},
                {y:578, e:"北周武帝建德七年/宣政元年", offset:-1},
                {y:573, e:"北周武帝建德", offset:1}, 
                {y:572, e:"北周武帝天和七年/建德元年", offset:-1},
                {y:566, e:"北周武帝天和"}, {y:561, e:"北周武帝保定"},
                {y:559, e:"北周明帝武成"}, {y:557, e:"北周明帝"},
                {y:554, e:"西魏恭帝"}, {y:552, e:"西魏元钦"},
                {y:535, e:"西魏文帝大统"},  {y:532, e:"北魏孝武帝永熙"},
                {y:531, e:"北魏普泰/中兴元年", offset:-1}, 
                {y:530, e:"北魏永安三年/建明元年", offset:-1},
                {y:529, e:"北魏孝庄帝永安二年", offset:-1}, 
                {y:528, e:"北魏武泰/建义/永安元年", offset:-1},
                {y:526, e:"北魏孝明帝孝昌", offset:1}, 
                {y:525, e:"北魏孝明帝正光六年/孝昌元年", offset:-1},
                {y:521, e:"北魏孝明帝正光", offset:1}, 
                {y:520, e:"北魏孝明帝神龟三年/正光元年", offset:-1},
                {y:519, e:"北魏孝明帝神龟二年", offset:-1}, 
                {y:518, e:"北魏孝明帝熙平三年/神龟元年", offset:-1},
                {y:516, e:"北魏孝明帝熙平"}, {y:513, e:"北魏宣武帝延昌", offset:1},
                {y:512, e:"北魏宣武帝永平五年/延昌元年", offset:-1},
                {y:509, e:"北魏宣武帝永平", offset:1}, 
                {y:508, e:"北魏宣武帝正始五年/永平元年", offset:-1},
                {y:504, e:"北魏宣武帝正始"}, {y:500, e:"北魏宣武帝景明"},
                {y:477, e:"北魏孝文帝太和"},
                {y:476, e:"北魏孝文帝延兴六年/承明元年", offset:-1},
                {y:472, e:"北魏孝文帝延兴", offset:1},
                {y:471, e:"北魏献文帝皇兴五年/孝文帝延兴元年", offset:-1},
                {y:468, e:"北魏献文帝皇兴", offset:1}, 
                {y:467, e:"北魏献文帝天安二年/皇兴元年", offset:-1},
                {y:466, e:"北魏献文帝天安元年", offset:-1}, 
                {y:460, e:"北魏文成帝和平"},
                {y:456, e:"北魏文成帝太安", offset:1}, 
                {y:455, e:"北魏文成帝兴光二年/太安元年", offset:-1},
                {y:454, e:"北魏文成帝兴安三年/兴光元年", offset:-1},
                {y:453, e:"北魏文成帝兴安二年", offset:-1},
                {y:452, e:"北魏正平二年/承平/兴安元年", offset:-1},
                {y:451, e:"北魏太武帝太平真君十二年/正平元年", offset:-1},
                {y:441, e:"北魏太武帝太平真君", offset:1},
                {y:440, e:"北魏太武帝太延六年/太平真君元年", offset:-1},
                {y:435, e:"北魏太武帝太延"}, {y:432, e:"北魏太武帝延和"},
                {y:429, e:"北魏太武帝神䴥", offset:1},
                {y:428, e:"北魏太武帝始光五年/神䴥元年", offset:-1},
                {y:424, e:"北魏太武帝始光"}, {y:417, e:"北魏明元帝泰常", offset:1},
                {y:416, e:"北魏明元帝神瑞三年/泰常元年", offset:-1},
                {y:414, e:"北魏明元帝神瑞"}, {y:410, e:"北魏明元帝永兴", offset:1},
                {y:409, e:"北魏道武帝天赐六年/明元帝永兴元年", offset:-1},
                {y:405, e:"北魏道武帝天赐", offset:1}, 
                {y:404, e:"北魏道武帝天兴七年/天赐元年", offset:-1},
                {y:398, e:"北魏道武帝天兴"}, 
                {y:397, e:"北魏道武帝皇始二年", offset:-1},
                {y:396, e:"北魏道武帝登国十一年/皇始元年", offset:-1},
                {y:386, e:"北魏道武帝登国"}, {y:-99999, e:""}];
    }
    
    // Eastern Wei and Northern Qi
    if (year > 533.5 && year < 577.5 && region=='WeiQi') {
        eras = [{y:1912, e:""}, {y:577, e:"北齐承光"},
                {y:570, e:"北齐武平"}, {y:566, e:"北齐天统", offset:1},
                {y:565, e:"北齐河清四年/天统元年", offset:-1},
                {y:563, e:"北齐武成帝河清", offset:1},
                {y:562, e:"北齐武成帝太宁二年/河清元年", offset:-1},
                {y:561, e:"北齐孝昭帝皇建二年/武成帝太宁元年", offset:-1},
                {y:560, e:"北齐乾明元年/孝昭帝皇建元年", offset:-1},
                {y:550, e:"北齐文宣帝天保"}, {y:543, e:"东魏武定"},
                {y:540, e:"东魏兴和", offset:1}, 
                {y:539, e:"东魏元象二年/兴和元年", offset:-1},
                {y:538, e:"东魏元象元年", offset:-1}, 
                {y:534, e:"东魏天平"}, {y:532, e:"北魏孝武帝永熙"},
                {y:-99999, e:""}];
    }
    
    // Southern dynasties, Sui dynasty
    if (year > 420 && year < 618 && region=='default') {
        eras = [{y:1912, e:""}, 
                {y:617, e:"隋炀帝大业十三年/恭帝义宁元年", offset:-1},
                {y:605, e:"隋炀帝大业"}, {y:601, e:"隋文帝仁寿"}, 
                {y:590, e:"隋文帝开皇", offset:9}, 
                {y:587, e:"[南北朝]陈后主祯明"}, 
                {y:583, e:"[南北朝]陈后主至德"}, 
                {y:569, e:"[南北朝]陈宣帝太建"}, {y:567, e:"[南北朝]陈伯宗光大"}, 
                {y:566, e:"[南北朝]陈文帝天嘉七年/天康元年", offset:-1}, 
                {y:560, e:"[南北朝]陈文帝天嘉"}, {y:558, e:"[南北朝]陈武帝永定", offset:1}, 
                {y:557, e:"[南北朝]梁敬帝太平二年/陈武帝永定元年", offset:-1},
                {y:556, e:"[南北朝]梁敬帝绍泰二年/太平元年", offset:-1}, 
                {y:555, e:"[南北朝]梁元帝承圣四年/闵帝天成元年/敬帝绍泰元年", offset:-1}, 
                {y:552, e:"[南北朝]梁元帝承圣"}, {y:550, e:"[南北朝]梁简文帝大宝"}, 
                {y:548, e:"[南北朝]梁武帝太清", offset:1},
                {y:547, e:"[南北朝]梁武帝中大同二年/太清元年", offset:-1},
                {y:546, e:"[南北朝]梁武帝大同十二年/中大同元年", offset:-1},
                {y:535, e:"[南北朝]梁武帝大同"},
                {y:530, e:"[南北朝]梁武帝中大通", offset:1},
                {y:529, e:"[南北朝]梁武帝大通三年/中大通元年", offset:-1},
                {y:528, e:"[南北朝]梁武帝大通二年", offset:-1}, 
                {y:527, e:"[南北朝]梁武帝普通八年/大通元年", offset:-1}, 
                {y:520, e:"[南北朝]梁武帝普通"}, 
                {y:503, e:"[南北朝]梁武帝天监", offset:1}, 
                {y:502, e:"[南北朝]齐中兴二年/梁武帝天监元年", offset:-1}, 
                {y:501, e:"[南北朝]齐永元三年/中兴元年", offset:-1}, 
                {y:499, e:"[南北朝]齐永元"}, 
                {y:498, e:"[南北朝]齐明帝建武五年/永泰元年", offset:-1}, 
                {y:495, e:"[南北朝]齐明帝建武", offset:1},
                {y:494, e:"[南北朝]齐隆昌元年/延兴元年/明帝建武元年", offset:-1},
                {y:483, e:"[南北朝]齐武帝永明"}, 
                {y:480, e:"[南北朝]齐高帝建元", offset:1}, 
                {y:479, e:"[南北朝]宋顺帝升明三年/齐高帝建元元年", offset:-1},
                {y:478, e:"[南北朝]宋顺帝升明二年", offset:-1}, 
                {y:477, e:"[南北朝]宋元徽五年/顺帝升明元年", offset:-1}, 
                {y:473, e:"[南北朝]宋元徽"}, 
                {y:472, e:"[南北朝]宋明帝泰豫元年", offset:-1}, 
                {y:466, e:"[南北朝]宋明帝泰始", offset:1}, 
                {y:465, e:"[南北朝]宋废帝永光元年/景和元年/明帝泰始元年", offset:-1}, 
                {y:457, e:"[南北朝]宋孝武帝大明"}, 
                {y:454, e:"[南北朝]宋孝武帝孝建"}, 
                {y:425, e:"[南北朝]宋文帝元嘉", offset:1}, 
                {y:424, e:"[南北朝]宋少帝景平二年/文帝元嘉元年", offset:-1}, 
                {y:423, e:"[南北朝]宋少帝景平元年", offset:-1}, 
                {y:421, e:"[南北朝]宋武帝永初", offset:1}, 
                {y:-99999, e:""}];
    }
    
    // Tang dynasty
    if (year >= 618 && year <= 705) {
        eras = [{y:1912, e:""}, 
                {y:705, e:"武周/唐中宗神龙元年", offset:-1}, 
                {y:702, e:"武周长安", offset:1}, 
                {y:701, e:"武周大足元年/长安元年", offset:-1}, 
                {y:700, e:"武周圣历三年/久视元年", offset:-1}, 
                {y:698, e:"武周圣历"},
                {y:697, e:"武周万岁通天二年", offset:-1}, 
                {y:696, e:"武周万岁登封元年/万岁通天元年", offset:-1}, 
                {y:695, e:"武周证圣元年/天册万岁元年", offset:-1}, 
                {y:694, e:"武周长寿三年/延载元年", offset:-1}, 
                {y:693, e:"武周长寿二年", offset:-1}, 
                {y:692, e:"武周天授三年/如意元年/长寿元年", offset:-1}, 
                {y:691, e:"武周天授二年", offset:-1}, 
                {y:690, e:"唐睿宗载初二年/武周天授元年", offset:-1}, 
                {y:689, e:"唐睿宗永昌元年/载初元年", offset:-1}, 
                {y:685, e:"唐睿宗垂拱"}, 
                {y:684, e:"唐中宗嗣圣元年/睿宗文明元年/光宅元年", offset:-1},
                {y:683, e:"唐高宗永淳二年/弘道元年", offset:-1},
                {y:682, e:"唐高宗开耀二年/永淳元年", offset:-1},
                {y:681, e:"唐高宗永隆二年/开耀元年", offset:-1},
                {y:680, e:"唐高宗调露二年/永隆元年", offset:-1},
                {y:679, e:"唐高宗仪凤四年/调露元年", offset:-1},
                {y:677, e:"唐高宗仪凤", offset:1},
                {y:676, e:"唐高宗上元三年/仪凤元年", offset:-1},
                {y:675, e:"唐高宗上元二年", offset:-1},
                {y:674, e:"唐高宗咸亨五年/上元元年", offset:-1},
                {y:671, e:"唐高宗咸亨", offset:1},
                {y:670, e:"唐高宗总章三年/咸亨元年", offset:-1},
                {y:669, e:"唐高宗总章二年", offset:-1},
                {y:668, e:"唐高宗乾封三年/总章元年", offset:-1},
                {y:666, e:"唐高宗乾封"}, {y:664, e:"唐高宗麟德"}, 
                {y:662, e:"唐高宗龙朔", offset:1}, 
                {y:661, e:"唐高宗显庆六年/龙朔元年", offset:-1}, 
                {y:656, e:"唐高宗显庆"}, {y:650, e:"唐高宗永徽"}, 
                {y:627, e:"唐太宗贞观"}, {y:619, e:"唐高祖武德", offset:1},
                {y:618, e:"隋恭帝义宁二年/唐高祖武德元年", offset:-1},
                {y:-99999, e:""}];
    }
    if (year >= 706 && year < 907) {
        eras = [{y:1912, e:""}, 
                {y:905, e:"唐哀帝天佑", offset:1},
                {y:904, e:"唐昭宗天复四年/天佑元年", offset:-1},
                {y:902, e:"唐昭宗天复", offset:1},
                {y:901, e:"唐昭宗光化四年/天复元年", offset:-1},
                {y:899, e:"唐昭宗光化", offset:1},
                {y:898, e:"唐昭宗乾宁五年/光化元年", offset:-1},
                {y:894, e:"唐昭宗乾宁"}, {y:892, e:"唐昭宗景福"},
                {y:890, e:"唐昭宗大顺"}, {y:889, e:"唐昭宗龙纪元年", offset:-1},
                {y:888, e:"唐僖宗光启四年/文德元年", offset:-1}, 
                {y:886, e:"唐僖宗光启", offset:1},
                {y:885, e:"唐僖宗中和五年/光启元年", offset:-1},
                {y:882, e:"唐僖宗中和", offset:1},
                {y:881, e:"唐僖宗广明二年/中和元年", offset:-1},
                {y:880, e:"唐僖宗广明元年", offset:-1}, 
                {y:875, e:"唐僖宗乾符", offset:1},
                {y:874, e:"唐僖宗咸通十五/乾符元年", offset:-1},
                {y:861, e:"唐懿宗咸通", offset:1},
                {y:860, e:"唐懿宗大中十四年/咸通元年", offset:-1},
                {y:847, e:"唐宣宗大中"}, {y:841, e:"唐武宗会昌"}, 
                {y:836, e:"唐文宗开成"}, {y:828, e:"唐文宗大和", offset:1}, 
                {y:827, e:"唐敬宗宝历三年/文宗大和元年", offset:-1},
                {y:825, e:"唐敬宗宝历"}, {y:821, e:"唐穆宗长庆"}, 
                {y:806, e:"唐宪宗元和"}, 
                {y:805, e:"唐德宗贞元二十一年/顺宗永贞元年", offset:-1},
                {y:785, e:"唐德宗贞元"}, {y:784, e:"唐德宗兴元"}, 
                {y:780, e:"唐德宗建中"}, {y:767, e:"唐代宗大历", offset:1}, 
                {y:766, e:"唐代宗永泰二年/大历元年", offset:-1},
                {y:765, e:"唐代宗永泰元年", offset:-1}, 
                {y:764, e:"唐代宗广德二年", offset:-1}, 
                {y:763, e:"唐肃宗宝应二年/代宗广德元年", offset:-1}, 
                {y:762, e:"唐肃宗上元三年/宝应元年", offset:-1}, 
                {y:761, e:"唐肃宗上元二年", offset:-1}, 
                {y:760, e:"唐肃宗乾元三年/上元元年", offset:-1}, 
                {y:759, e:"唐肃宗乾元二年", offset:-1}, 
                {y:758, e:"唐肃宗至德三载/乾元元年", offset:-1}, 
                {y:757, e:"唐肃宗至德二载", offset:-1}, 
                {y:756, e:"唐玄宗天宝十五载/肃宗至德元载", offset:-1}, 
                {y:742, e:"唐玄宗天宝"}, {y:714, e:"唐玄宗开元", offset:1}, 
                {y:713, e:"唐玄宗先天二年/开元元年", offset:-1}, 
                {y:712, e:"唐睿宗太极元年/延和元年/玄宗先天元年", offset:-1},
                {y:711, e:"唐睿宗景云二年", offset:-1}, 
                {y:710, e:"唐中宗景龙四年/殇帝唐隆元年/睿宗景云元年", offset:-1}, 
                {y:708, e:"唐中宗景龙", offset:1}, 
                {y:707, e:"唐中宗神龙三年/景龙元年", offset:-1}, 
                {y:706, e:"唐中宗神龙二年", offset:-1}, 
                {y:-99999, e:""}];
        if (year > 743 && year < 758) { nian = "载";}
    }
    
    // Five dynasties
    if (year >= 907 && year <= 959) {
        eras = [{y:1912, e:""}, 
                {y:959, e:"[五代]后周世宗/恭帝显德六年", offset:-1}, 
                {y:955, e:"[五代]后周世宗显德", offset:1},
                {y:954, e:"[五代]后周太祖/世宗显德元年", offset:-1}, 
                {y:951, e:"[五代]后周太祖广顺"}, 
                {y:949, e:"[五代]后汉隐帝乾佑", offset:1}, 
                {y:948, e:"[五代]后汉高祖/隐帝乾佑元年", offset:-1}, 
                {y:947, e:"[五代]后汉高祖天福十二年", offset:-1}, 
                {y:945, e:"[五代]后晋出帝开运", offset:1}, 
                {y:944, e:"[五代]后晋出帝天福九年/开运元年", offset:-1}, 
                {y:942, e:"[五代]后晋出帝天福", offset:6}, 
                {y:937, e:"[五代]后晋高祖天福", offset:1}, 
                {y:936, e:"[五代]后唐清泰三年/后晋高祖天福元年", offset:-1}, 
                {y:935, e:"[五代]后唐清泰二年", offset:-1},
                {y:934, e:"[五代]后唐闵帝应顺元年/李从珂清泰元年", offset:-1},
                {y:931, e:"[五代]后唐明宗长兴", offset:1}, 
                {y:930, e:"[五代]后唐明宗天成五年/长兴元年", offset:-1}, 
                {y:927, e:"[五代]后唐明宗天成", offset:1}, 
                {y:926, e:"[五代]后唐庄宗同光四年/明宗天成元年", offset:-1}, 
                {y:924, e:"[五代]后唐庄宗同光", offset:1}, 
                {y:923, e:"[五代]后梁末帝龙德三年/后唐庄宗同光元年", offset:-1}, 
                {y:922, e:"[五代]后梁末帝龙德二年", offset:-1}, 
                {y:921, e:"[五代]后梁末帝贞明七年/龙德元年", offset:-1}, 
                {y:916, e:"[五代]后梁末帝贞明", offset:1}, 
                {y:915, e:"[五代]后梁末帝乾化五年/贞明元年", offset:-1}, 
                {y:914, e:"[五代]后梁末帝乾化四年", offset:-1}, 
                {y:913, e:"[五代]后梁凤历元年/末帝乾化三年", offset:-1}, 
                {y:912, e:"[五代]后梁太祖乾化二年", offset:-1}, 
                {y:911, e:"[五代]后梁太祖开平五年/乾化元年", offset:-1}, 
                {y:908, e:"[五代]后梁太祖开平", offset:1}, 
                {y:907, e:"唐哀帝天佑四年/[五代]后梁太祖开平元年", offset:-1},
                {y:-99999, e:""}];
    }
    
    // Northern Song dynasty
    if (year >= 960 && year <= 1126) {
        eras = [{y:1912, e:""}, 
                {y:1126, e:"宋钦宗靖康元年", offset:-1}, 
                {y:1120, e:"宋徽宗宣和", offset:1}, 
                {y:1119, e:"宋徽宗重和二年/宣和元年", offset:-1}, 
                {y:1118, e:"宋徽宗政和八年/重和元年", offset:-1}, 
                {y:1111, e:"宋徽宗政和"}, {y:1107, e:"宋徽宗大观"}, 
                {y:1102, e:"宋徽宗崇宁"}, {y:1101, e:"宋徽宗建中靖国"}, 
                {y:1099, e:"宋哲宗元符", offset:1}, 
                {y:1098, e:"宋哲宗绍圣五年/元符元年", offset:-1}, 
                {y:1095, e:"宋哲宗绍圣", offset:1}, 
                {y:1094, e:"宋哲宗元佑九年/绍圣元年", offset:-1}, 
                {y:1086, e:"宋哲宗元佑"}, {y:1078, e:"宋神宗元丰"}, 
                {y:1068, e:"宋神宗熙宁"}, {y:1064, e:"宋英宗治平"}, 
                {y:1057, e:"宋仁宗嘉佑", offset:1}, 
                {y:1056, e:"宋仁宗至和三年/嘉佑元年", offset:-1},
                {y:1055, e:"宋仁宗至和二年", offset:-1},
                {y:1054, e:"宋仁宗皇佑六年/至和元年", offset:-1}, 
                {y:1049, e:"宋仁宗皇佑"}, 
                {y:1042, e:"宋仁宗庆历", offset:1}, 
                {y:1041, e:"宋仁宗康定二年/庆历元年", offset:-1}, 
                {y:1040, e:"宋仁宗宝元三年/康定元年", offset:-1}, 
                {y:1039, e:"宋仁宗宝元二年", offset:-1}, 
                {y:1038, e:"宋仁宗景佑五年/宝元元年", offset:-1}, 
                {y:1034, e:"宋仁宗景佑"}, 
                {y:1033, e:"宋仁宗明道二年", offset:-1}, 
                {y:1032, e:"宋仁宗天圣十年/明道元年", offset:-1}, 
                {y:1023, e:"宋仁宗天圣"}, {y:1022, e:"宋真宗乾兴"}, 
                {y:1017, e:"宋真宗天禧"}, {y:1008, e:"宋真宗大中祥符"}, 
                {y:1004, e:"宋真宗景德"}, {y:998, e:"宋真宗咸平"}, 
                {y:995, e:"宋太宗至道"}, {y:990, e:"宋太宗淳化"}, 
                {y:988, e:"宋太宗端拱"}, {y:985, e:"宋太宗雍熙", offset:1}, 
                {y:984, e:"宋太宗太平兴国九年/雍熙元年", offset:-1}, 
                {y:977, e:"宋太宗太平兴国", offset:1}, 
                {y:976, e:"宋太祖开宝九年/太宗太平兴国元年", offset:-1}, 
                {y:969, e:"宋太祖开宝", offset:1},
                {y:968, e:"宋太祖乾德六年/开宝元年", offset:-1}, 
                {y:964, e:"宋太祖乾德", offset:1},
                {y:963, e:"宋太祖建隆四年/乾德元年", offset:-1}, 
                {y:961, e:"宋太祖建隆", offset:1}, 
                {y:960, e:"[五代]后周恭帝显德七年/宋太祖建隆元年", offset:-1},
                {y:-99999, e:""}];
    }
    
    // Southern Song dynasty
    if (year >= 1127 && year <= 1279) {
        eras = [{y:1912, e:""}, 
                {y:1279, e:"宋帝昺祥兴二年/元世祖至元十六年", offset:-1},
                {y:1278, e:"宋端宗景炎三年/帝昺祥兴元年", offset:-1},
                {y:1277, e:"宋端宗景炎二年", offset:-1},
                {y:1276, e:"宋恭帝德佑二年/端宗景炎元年", offset:-1},
                {y:1275, e:"宋恭帝德佑元年", offset:-1},
                {y:1265, e:"宋度宗咸淳"}, {y:1260, e:"宋理宗景定"}, 
                {y:1259, e:"宋理宗开庆"}, {y:1253, e:"宋理宗宝佑"},
                {y:1241, e:"宋理宗淳佑"}, {y:1237, e:"宋理宗嘉熙"}, 
                {y:1234, e:"宋理宗端平"}, {y:1228, e:"宋理宗绍定"}, 
                {y:1225, e:"宋理宗宝庆"}, {y:1208, e:"宋宁宗嘉定"}, 
                {y:1205, e:"宋宁宗开禧"}, {y:1201, e:"宋宁宗嘉泰"}, 
                {y:1195, e:"宋宁宗庆元"}, {y:1190, e:"宋光宗绍熙"}, 
                {y:1174, e:"宋孝宗淳熙"}, {y:1165, e:"宋孝宗乾道"}, 
                {y:1163, e:"宋孝宗隆兴"}, {y:1131, e:"宋高宗绍兴"}, 
                {y:1128, e:"宋高宗建炎", offset:1},
                {y:1127, e:"宋钦宗靖康二年/宋高宗建炎元年", offset:-1}, 
                {y:-99999, e:""}];
    }
    
       if (year > 945.5 && year < 1280.5 && region=='LiaoJinYuan') {
        eras = [{y:1912, e:""}, {y:1265, e:"元世祖至元", offset:1},
                {y:1264, e:"元世祖中统五年/至元元年", offset:-1},
                {y:1260, e:"元世祖中统"}, {y:1251, e:"元宪宗"},
                {y:1249, e:"元定宗后"}, {y:1246, e:"元定宗"},
                {y:1242, e:"元太宗后"}, {y:1235, e:"元太宗", offset:6},
                {y:1234, e:"金哀宗天兴三年/元太宗六年", offset:-1},
                {y:1232, e:"金哀宗天兴"}, {y:1224, e:"金哀宗正大"},
                {y:1223, e:"金宣宗元光二年", offset:-1},
                {y:1222, e:"金宣宗兴定六年/元光元年", offset:-1},
                {y:1218, e:"金宣宗兴定", offset:1}, 
                {y:1217, e:"金宣宗贞佑五年/兴定元年", offset:-1},
                {y:1214, e:"金宣宗贞佑", offset:1}, 
                {y:1213, e:"金崇庆二年/至宁/贞佑元年", offset:-1},
                {y:1212, e:"金崇庆元年", offset:-1}, 
                {y:1209, e:"金大安"}, {y:1201, e:"金章宗泰和"}, 
                {y:1197, e:"金章宗承安", offset:1},
                {y:1196, e:"金章宗明昌七年/承安元年", offset:-1},
                {y:1190, e:"金章宗明昌"}, 
                {y:1162, e:"金世宗大定", offset:1},
                {y:1161, e:"金正隆六年/大定元年", offset:-1},
                {y:1157, e:"金正隆", offset:1}, 
                {y:1156, e:"金贞元四年/正隆元年", offset:-1},
                {y:1154, e:"金贞元", offset:1}, 
                {y:1153, e:"金天德五年/贞元元年", offset:-1},
                {y:1150, e:"金天德", offset:1}, 
                {y:1149, e:"金皇统九年/天德元年", offset:-1},
                {y:1141, e:"金熙宗皇统"}, {y:1138, e:"金熙宗天眷"},
                {y:1135, e:"金熙宗天会", offset:12},
                {y:1126, e:"金太宗天会", offset:3}, 
                {y:1125, e:"辽天祚帝保大五年/金太宗天会三年", offset:-1},
                {y:1121, e:"辽天祚帝保大"}, {y:1111, e:"辽天祚帝天庆"},
                {y:1102, e:"辽天祚帝乾统", offset:1}, 
                {y:1101, e:"辽道宗寿昌七年/天祚帝乾统元年", offset:-1},
                {y:1095, e:"辽道宗寿昌"}, {y:1085, e:"辽道宗大安"},
                {y:1075, e:"辽道宗大康"}, {y:1065, e:"辽道宗咸雍"},
                {y:1056, e:"辽道宗清宁", offset:1}, 
                {y:1055, e:"辽兴宗重熙廿四年/道宗清宁元年", offset:-1},
                {y:1033, e:"辽兴宗重熙", offset:1}, 
                {y:1032, e:"辽兴宗景福二年/重熙元年", offset:-1},
                {y:1031, e:"辽圣宗太平十一年/兴宗景福元年", offset:-1},
                {y:1022, e:"辽圣宗太平", offset:1}, 
                {y:1021, e:"辽圣宗开泰十年/太平元年", offset:-1},
                {y:1013, e:"辽圣宗开泰", offset:1}, 
                {y:1012, e:"辽圣宗统和三十年/开泰元年", offset:-1},
                {y:984, e:"辽圣宗统和", offset:1}, 
                {y:983, e:"辽圣宗乾亨五年/统和元年", offset:-1},
                {y:980, e:"辽景宗乾亨", offset:1}, 
                {y:979, e:"辽景宗保宁十一年/乾亨元年", offset:-1},
                {y:970, e:"辽景宗保宁", offset:1}, 
                {y:969, e:"辽穆宗应历十九年/景宗保宁元年", offset:-1},
                {y:952, e:"辽穆宗应历", offset:1}, 
                {y:951, e:"辽世宗天禄五年/穆宗应历元年", offset:-1},
                {y:948, e:"辽世宗天禄", offset:1}, 
                {y:947, e:"辽太宗会同十年/大同元年/世宗天禄元年", offset:-1},
                {y:939, e:"辽太宗会同", offset:1},
                {y:-99999, e:""}];
    }
    
    // Yuan dynasty
    if (year >=1280 && year <=1367) {
        eras = [{y:1912, e:""}, {y:1341, e:"元顺帝至正"},
                {y:1336, e:"元顺帝至元", offset:1}, 
                {y:1335, e:"元顺帝元统三年/至元元年", offset:-1},
                {y:1334, e:"元顺帝元统二年", offset:-1},
                {y:1333, e:"元顺帝至顺四年/元统元年", offset:-1},
                {y:1332, e:"元文宗/宁宗/顺帝至顺三年", offset:-1},
                {y:1331, e:"元文宗至顺二年", offset:-1},
                {y:1330, e:"元文宗天历三年/至顺元年", offset:-1},
                {y:1329, e:"元文宗/明宗天历二年", offset:-1},
                {y:1328, e:"元泰定帝泰定五年/致和元年/元天顺帝天顺元年/元文宗天历元年", offset:-1},
                {y:1324, e:"元泰定帝泰定"}, {y:1321, e:"元英宗至治"},
                {y:1314, e:"元仁宗延佑"}, {y:1312, e:"元仁宗皇庆"},
                {y:1308, e:"元武宗至大"}, {y:1298, e:"元成宗大德", offset:1},
                {y:1297, e:"元成宗元贞三年/大德元年", offset:-1}, 
                {y:1295, e:"元成宗元贞"}, {y:1264, e:"元世祖至元"},
                {y:-99999, e:""}];
    }
    
    // Ming dynasty
    if (year >= 1368 && year <= 1644) {
        eras = [{y:1912, e:""}, 
                {y:1644, e:"明思宗崇祯十七年/清世祖顺治元年", offset:-1}, 
                {y:1628, e:"明思宗崇祯"}, 
                {y:1621, e:"明熹宗天启"}, {y:1620, e:"明神宗万历四十八年/明光宗泰昌元年", offset:-1}, 
                {y:1573, e:"明神宗万历"}, {y:1567, e:"明穆宗隆庆"},
                {y:1522, e:"明世宗嘉靖"}, {y:1506, e:"明武宗正德"},
                {y:1488, e:"明孝宗弘治"}, {y:1465, e:"明宪宗成化"},
                {y:1457, e:"明英宗天顺"}, {y:1450, e:"明代宗景泰"},
                {y:1436, e:"明英宗正统"}, {y:1426, e:"明宣宗宣德"},
                {y:1425, e:"明仁宗洪熙"}, {y:1403, e:"明成祖永乐"},
                {y:1402, e:"明惠帝建文四年/明成祖洪武三十五年", offset:-1},
                {y:1399, e:"明惠帝建文"}, {y:1369, e:"明太祖洪武", offset:1},
                {y:1368, e:"元顺帝至正二十八年/明太祖洪武元年", offset:-1},
                {y:-99999, e:""}];
    }
    
    // Qing dynasty
    if (year >= 1645 && year <= 1911) {
        eras = [{y:1912, e:""}, {y:1909, e:"清宣统"}, 
           {y:1875, e:"清德宗光绪"}, {y:1862, e:"清穆宗同治"}, 
           {y:1851, e:"清文宗咸丰"}, {y:1821, e:"清宣宗道光"}, 
           {y:1796, e:"清仁宗嘉庆"}, {y:1736, e:"清高宗乾隆"},
           {y:1723, e:"清世宗雍正"}, {y:1662, e:"清圣祖康熙"},
           {y:1644, e:"清世祖顺治"}, {y:-99999, e:""}];
    }

    // Southern Ming and Zheng dynasty
    if (year >= 1644 && year <= 1685 && region=='SouthernMing') {
        eras = [{y:1912, e:""}, {y:1662, e:"明郑永历", offset:15}, {y:1654, e:"南明永历", offset:7},
        {y:1653, e:"南明永历七年/鲁王监国八年", offset:-1}, {y:1652, e:"南明永历六年/鲁王监国七年", offset:-1},
        {y:1651, e:"南明永历五年/鲁王监国六年", offset:-1}, {y:1650, e:"南明永历四年/鲁王监国五年", offset:-1},
        {y:1649, e:"南明永历三年/鲁王监国四年", offset:-1}, {y:1648, e:"南明永历二年/鲁王监国三年", offset:-1},
        {y:1647, e:"南明永历元年/鲁王监国二年", offset:-1}, {y:1646, e:"南明隆武二年/鲁王监国元年", offset:-1},
        {y:1645, e:"南明弘光元年/隆武元年", offset:-1}, {y:1628, e:"明崇祯"}];
    }
    
    let chineseNumbers = ["一","二","三","四","五","六","七","八","九","十"];
    let n = eras.length;
    let era="";
    for (let i=0; i<n; i++) {
        if (year >= eras[i].y) {
            if (eras[i].e != "") {
                era = "("+eras[i].e;
                let offset = ('offset' in eras[i] ? eras[i].offset:0);
                let ey = year - eras[i].y + 1 + offset;
                if (offset >= 0) {
                    if (ey==1) {
                        era += "元"+nian+")";
                    } else if (ey < 11) {
                        era += chineseNumbers[ey-1]+nian+")";
                    } else if (ey < 20) {
                        era += chineseNumbers[9]+chineseNumbers[ey-11] + nian + ")";
                    } else {
                        let i1 = Math.floor(ey*0.1);
                        let i0 = ey - 10*i1;
                        era += chineseNumbers[i1-1]+chineseNumbers[9];
                        if (i0 > 0) {
                            era += chineseNumbers[i0-1];
                        }
                        era += nian+")";
                    }
                } else {
                    era += ")";
                }
            }
            break;
        }
    }
    return era;
}
